[Killed] StringLiteral
app/components/footer/footer.component.harness.ts:9:44
   static readonly hostSelector = 'app-footer';
 
   private _todoCount = this.locatorFor('.todo-count strong');
-  private _todoCountText = this.locatorFor('.todo-count');
+  private _todoCountText = this.locatorFor("");
   private _clearCompleted = this.locatorForOptional('.clear-completed');
   private _filters = this.locatorForAll('.filters a');
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: SyntaxError: Failed to execute 'querySelectorAll' on 'Element': The provided selector is empty.

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:13:41
   private _clearCompleted = this.locatorForOptional('.clear-completed');
   private _filters = this.locatorForAll('.filters a');
 
-  async getTodoCount(): Promise<number> {
-    const todoCountEl = await this._todoCount();
-    const count = await todoCountEl.text();
-    return +count;
-  }
+  async getTodoCount(): Promise<number> {}
 
   async getTodoCountText(): Promise<string> { 
killedBy: FooterComponent should return the total amount of todos left
statusReason: Expected undefined to be 0.

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:19:45
     return +count;
   }
 
-  async getTodoCountText(): Promise<string> { 
-    const todoCountEl = await this._todoCountText();
-    return await todoCountEl.text();
-  }
+  async getTodoCountText(): Promise<string> {}
 
   async clearCompleted(): Promise<void> {
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: Expected undefined to be '0 items left'.

[NoCoverage] BlockStatement
app/components/footer/footer.component.harness.ts:24:41
     return await todoCountEl.text();
   }
 
-  async clearCompleted(): Promise<void> {
-    const clearCompletedEl = await this._clearCompleted();
-    if (clearCompletedEl) {
-      await clearCompletedEl.click();
-    }
-  }
+  async clearCompleted(): Promise<void> {}
 
   async getFilters(): Promise<FilterTypes[]> {

[NoCoverage] ConditionalExpression
app/components/footer/footer.component.harness.ts:26:9
 
   async clearCompleted(): Promise<void> {
     const clearCompletedEl = await this._clearCompleted();
-    if (clearCompletedEl) {
+    if (true) {
       await clearCompletedEl.click();
     }

[NoCoverage] ConditionalExpression
app/components/footer/footer.component.harness.ts:26:9
 
   async clearCompleted(): Promise<void> {
     const clearCompletedEl = await this._clearCompleted();
-    if (clearCompletedEl) {
+    if (false) {
       await clearCompletedEl.click();
     }

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:31:46
     }
   }
 
-  async getFilters(): Promise<FilterTypes[]> {
-    const filters = await this._filters();
-    return await parallel(() =>
-      filters.map(async filterEl => {
-        const text = await filterEl.text();
-        return text as FilterTypes;
-      })
-    );
-  }
+  async getFilters(): Promise<FilterTypes[]> {}
 
   async clickFilter(filterText: FilterTypes): Promise<void> {
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Expected undefined to equal [ 'All', 'Active', 'Completed' ].

[Killed] ArrowFunction
app/components/footer/footer.component.harness.ts:33:27
 
   async getFilters(): Promise<FilterTypes[]> {
     const filters = await this._filters();
-    return await parallel(() =>
-      filters.map(async filterEl => {
-        const text = await filterEl.text();
-        return text as FilterTypes;
-      })
+    return await parallel(() => undefined
     );
   }
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: TypeError: values is not iterable

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:41:61
     );
   }
 
-  async clickFilter(filterText: FilterTypes): Promise<void> {
-    const filters = await this._filters();
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) {
-        await filter.click();
-      }
-    }
-  }
+  async clickFilter(filterText: FilterTypes): Promise<void> {}
 
   async isFilterSelected(filterText: FilterTypes): Promise<boolean> {
killedBy: FooterComponent should have the "Active" filter selected
statusReason: Expected false to be true.

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:43:35
 
   async clickFilter(filterText: FilterTypes): Promise<void> {
     const filters = await this._filters();
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) {
-        await filter.click();
-      }
-    }
+    for (const filter of filters) {}
   }
 
killedBy: FooterComponent should have the "Active" filter selected
statusReason: Expected false to be true.

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:51:69
     }
   }
 
-  async isFilterSelected(filterText: FilterTypes): Promise<boolean> {
-    const filters = await this._filters();
-    let selected: TestElement | null = null;
-
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) { 
-        selected = filter;
-      }
-    }
-    
-    return selected ? selected.hasClass("selected") : false;
-  }
+  async isFilterSelected(filterText: FilterTypes): Promise<boolean> {}
 }
 
killedBy: FooterComponent should have the "All" filter active by default
statusReason: Expected undefined to be true.
