[Killed] ArrayDeclaration
app/components/footer/footer.component.ts:34:32
   imports: [NgFor, NgIf, AsyncPipe]
 })
 export class FooterComponent {
-  filterTitles: FiltersObj[] = [
-    { key: 'all', value: 'All' },
-    { key: 'active', value: 'Active' },
-    { key: 'completed', value: 'Completed' }
-  ];
+  filterTitles: FiltersObj[] = [];
 
   itemsLeft$: Observable<number>;
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Expected $.length = 0 to equal 3.
Expected $[0] = undefined to equal 'All'.
Expected $[1] = undefined to equal 'Active'.
Expected $[2] = undefined to equal 'Completed'.

[Killed] StringLiteral
app/components/footer/footer.component.ts:37:32
   filterTitles: FiltersObj[] = [
     { key: 'all', value: 'All' },
     { key: 'active', value: 'Active' },
-    { key: 'completed', value: 'Completed' }
+    { key: 'completed', value: "" }
   ];
 
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Expected $[2] = '' to equal 'Completed'.

[Killed] ConditionalExpression
app/components/footer/footer.component.ts:51:67
   constructor(private store: Store<TodoStateInterface>) {
     this.itemsLeft$ = store.select(selectItemsLeft);
     this.completedCount$ = store.select(selectCompletedCount);
-    this.itemText$ = store.select((state: TodoStateInterface) => (selectItemsLeft(state) === 1 ? 'item' : 'items'));
+    this.itemText$ = store.select((state: TodoStateInterface) => (true ? 'item' : 'items'));
     this.filter$ = store.select(selectFilter);
   }
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: Expected '0 item left' to be '0 items left'.
