[Killed] StringLiteral
app/components/item/item.component.harness.ts:10:48
   private _toggle = this.locatorFor('.toggle');
   private _todoLabel = this.locatorFor('label');
   private _listItem = this.locatorFor('li');
-  private _editInput = this.locatorForOptional('.edit');
+  private _editInput = this.locatorForOptional("");
   private _remove = this.locatorFor('.destroy');
 
killedBy: ItemComponent should mark todo item as incomplete; ListComponent should not uncheck todo when already unchecked
statusReason: SyntaxError: Failed to execute 'querySelectorAll' on 'Element': The provided selector is empty.

[Killed] BlockStatement
app/components/item/item.component.harness.ts:13:33
   private _editInput = this.locatorForOptional('.edit');
   private _remove = this.locatorFor('.destroy');
 
-  async toggle(): Promise<void> {
-    const toggle = await this._toggle();
-    await toggle.click();
-  }
+  async toggle(): Promise<void> {}
 
   async check(): Promise<void> {
killedBy: ItemComponent should mark todo item as completed; ListComponent should update a todo
statusReason: Expected false to equal true.

[Killed] BlockStatement
app/components/item/item.component.harness.ts:18:32
     await toggle.click();
   }
 
-  async check(): Promise<void> {
-    const toggle = await this._toggle();
-    const isChecked = await toggle.hasClass('checked');
-    if (!isChecked) {
-      await this.toggle();
-    }
-  }
+  async check(): Promise<void> {}
 
   async uncheck(): Promise<void> {
killedBy: ListComponent should mark all todos as complete
statusReason: Expected false to be true.

[Survived] StringLiteral
app/components/item/item.component.harness.ts:20:45
 
   async check(): Promise<void> {
     const toggle = await this._toggle();
-    const isChecked = await toggle.hasClass('checked');
+    const isChecked = await toggle.hasClass("");
     if (!isChecked) {
       await this.toggle();

[Killed] BlockStatement
app/components/item/item.component.harness.ts:21:21
   async check(): Promise<void> {
     const toggle = await this._toggle();
     const isChecked = await toggle.hasClass('checked');
-    if (!isChecked) {
-      await this.toggle();
-    }
+    if (!isChecked) {}
   }
 
killedBy: ListComponent should mark all todos as complete
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/components/item/item.component.harness.ts:21:9
   async check(): Promise<void> {
     const toggle = await this._toggle();
     const isChecked = await toggle.hasClass('checked');
-    if (!isChecked) {
+    if (false) {
       await this.toggle();
     }
killedBy: ListComponent should mark all todos as complete
statusReason: Expected false to be true.

[Survived] BlockStatement
app/components/item/item.component.harness.ts:26:34
     }
   }
 
-  async uncheck(): Promise<void> {
-    const toggle = await this._toggle();
-    const isChecked = await toggle.hasClass('checked');
-    if (isChecked) {
-      await this.toggle();
-    }
-  }
+  async uncheck(): Promise<void> {}
 
   async getId(): Promise<string | null> {

[Killed] ConditionalExpression
app/components/item/item.component.harness.ts:29:9
   async uncheck(): Promise<void> {
     const toggle = await this._toggle();
     const isChecked = await toggle.hasClass('checked');
-    if (isChecked) {
+    if (true) {
       await this.toggle();
     }
killedBy: ListComponent should check todo when unchecked
statusReason: Expected true to equal false.

[NoCoverage] BlockStatement
app/components/item/item.component.harness.ts:29:20
   async uncheck(): Promise<void> {
     const toggle = await this._toggle();
     const isChecked = await toggle.hasClass('checked');
-    if (isChecked) {
-      await this.toggle();
-    }
+    if (isChecked) {}
   }
 

[Killed] BlockStatement
app/components/item/item.component.harness.ts:34:41
     }
   }
 
-  async getId(): Promise<string | null> {
-    const label = await this._todoLabel();
-    return label.getAttribute('id');
-  }
+  async getId(): Promise<string | null> {}
 
   async getTodoLabel(): Promise<string> {
killedBy: ListComponent should check todo when unchecked
statusReason: Expected 1 to equal 0.

[Killed] BlockStatement
app/components/item/item.component.harness.ts:39:41
     return label.getAttribute('id');
   }
 
-  async getTodoLabel(): Promise<string> {
-    const label = await this._todoLabel();
-    return label.text();
-  }
+  async getTodoLabel(): Promise<string> {}
 
   async isCompleted(): Promise<boolean> {
killedBy: ItemComponent should display todo item; ListComponent should update a todo
statusReason: Expected undefined to equal 'Demo'.

[Killed] BlockStatement
app/components/item/item.component.harness.ts:44:41
     return label.text();
   }
 
-  async isCompleted(): Promise<boolean> {
-    const toggle = await this._listItem();
-    return toggle.hasClass('completed');
-  }
+  async isCompleted(): Promise<boolean> {}
 
   async isEditModeEnabled(): Promise<boolean> {
killedBy: ListComponent should return a list of completed todos
statusReason: Expected 0 to equal 1.

[Killed] StringLiteral
app/components/item/item.component.harness.ts:46:28
 
   async isCompleted(): Promise<boolean> {
     const toggle = await this._listItem();
-    return toggle.hasClass('completed');
+    return toggle.hasClass("");
   }
 
killedBy: ListComponent should update a todo
statusReason: Expected 0 to equal 1.

[Killed] BlockStatement
app/components/item/item.component.harness.ts:49:47
     return toggle.hasClass('completed');
   }
 
-  async isEditModeEnabled(): Promise<boolean> {
-    const toggle = await this._editInput();
-    return toggle ? toggle.hasClass('edit') : false;
-  }
+  async isEditModeEnabled(): Promise<boolean> {}
 
   async remove(): Promise<void> {
killedBy: ItemComponent should enable edit mode
statusReason: Expected undefined to equal true.

[NoCoverage] BooleanLiteral
app/components/item/item.component.harness.ts:51:47
 
   async isEditModeEnabled(): Promise<boolean> {
     const toggle = await this._editInput();
-    return toggle ? toggle.hasClass('edit') : false;
+    return toggle ? toggle.hasClass('edit') : true;
   }
 

[Killed] StringLiteral
app/components/item/item.component.harness.ts:51:37
 
   async isEditModeEnabled(): Promise<boolean> {
     const toggle = await this._editInput();
-    return toggle ? toggle.hasClass('edit') : false;
+    return toggle ? toggle.hasClass("") : false;
   }
 
killedBy: ItemComponent should enable edit mode
statusReason: Expected false to equal true.

[Killed] BlockStatement
app/components/item/item.component.harness.ts:54:33
     return toggle ? toggle.hasClass('edit') : false;
   }
 
-  async remove(): Promise<void> {
-    const remove = await this._remove();
-    await remove.click();
-  }
+  async remove(): Promise<void> {}
 
   async enabledEditMode(): Promise<void> {
killedBy: ItemComponent should notify about remove button; ListComponent should remove a todo by Id
statusReason: Expected '' to equal 'e2bb892a-844a-47fb-a2b3-47f491af9d88'.

[Survived] BlockStatement
app/components/item/item.component.harness.ts:59:42
     await remove.click();
   }
 
-  async enabledEditMode(): Promise<void> {
-    const label = await this._todoLabel();
-    await label.dispatchEvent('dblclick');
-  }
+  async enabledEditMode(): Promise<void> {}
 
   async edit(todoToUpdate: UpdateTodo): Promise<void> {

[Killed] BlockStatement
app/components/item/item.component.harness.ts:64:55
     await label.dispatchEvent('dblclick');
   }
 
-  async edit(todoToUpdate: UpdateTodo): Promise<void> {
-    const { name, completed } = todoToUpdate;
-    await this.enabledEditMode();
-    const isComplete = await this.isCompleted();
-    const editInput = await this._editInput();
-    const label = await this._todoLabel();
-    if (name && editInput) {
-      await editInput.clear();
-      await editInput.sendKeys(name);
-      await editInput.blur();
-      await label.click();
-    }
-    if (completed !== isComplete) {
-      await this.toggle();
-    }
-  }
+  async edit(todoToUpdate: UpdateTodo): Promise<void> {}
 }
 
killedBy: ItemComponent should notify about update button; ListComponent should update a todo
statusReason: Expected object not to have properties
    name: ''

[Killed] BlockStatement
app/components/item/item.component.harness.ts:70:28
     const isComplete = await this.isCompleted();
     const editInput = await this._editInput();
     const label = await this._todoLabel();
-    if (name && editInput) {
-      await editInput.clear();
-      await editInput.sendKeys(name);
-      await editInput.blur();
-      await label.click();
-    }
+    if (name && editInput) {}
     if (completed !== isComplete) {
       await this.toggle();
killedBy: ListComponent should update a todo
statusReason: Expected $.name = 'Demo' to equal 'Demo 2'.

[Survived] LogicalOperator
app/components/item/item.component.harness.ts:70:9
     const isComplete = await this.isCompleted();
     const editInput = await this._editInput();
     const label = await this._todoLabel();
-    if (name && editInput) {
+    if (name || editInput) {
       await editInput.clear();
       await editInput.sendKeys(name);

[Killed] EqualityOperator
app/components/item/item.component.harness.ts:76:9
       await editInput.blur();
       await label.click();
     }
-    if (completed !== isComplete) {
+    if (completed === isComplete) {
       await this.toggle();
     }
killedBy: ItemComponent should notify about update button; ListComponent should update a todo
statusReason: Expected object to have properties
    completed: true
Expected object not to have properties
    name: 'Demo Update'

[Killed] BlockStatement
app/components/item/item.component.harness.ts:76:35
       await editInput.blur();
       await label.click();
     }
-    if (completed !== isComplete) {
-      await this.toggle();
-    }
+    if (completed !== isComplete) {}
   }
 }
killedBy: ItemComponent should notify about update button; ListComponent should update a todo
statusReason: Expected object to have properties
    completed: true
Expected object not to have properties
    name: 'Demo Update'
