[Killed] BlockStatement
app/components/list/list.component.harness.ts:13:52
 
   private todos = this.locatorForAll(ItemHarness);
 
-  async getTodos({ isCompleted }: TodoFilter = {}) {
-    const todos = await this.todos();
-    const todoList: ItemHarness[] = [];
-    if (isCompleted === undefined) {
-      return todos;
-    }
-    for (const todo of todos) {
-      const isComplete = await todo.isCompleted();
-      if (isComplete === isCompleted) todoList.push(todo);
-    }
-    return todoList;
-  }
+  async getTodos({ isCompleted }: TodoFilter = {}) {}
 
   async getTodoById(id: string): Promise<ItemHarness | undefined> {
killedBy: ListComponent should return an empty list of todo items
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:16:9
   async getTodos({ isCompleted }: TodoFilter = {}) {
     const todos = await this.todos();
     const todoList: ItemHarness[] = [];
-    if (isCompleted === undefined) {
+    if (false) {
       return todos;
     }
killedBy: ListComponent should return a list of todo items
statusReason: Expected 0 to equal 1.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:16:36
   async getTodos({ isCompleted }: TodoFilter = {}) {
     const todos = await this.todos();
     const todoList: ItemHarness[] = [];
-    if (isCompleted === undefined) {
-      return todos;
-    }
+    if (isCompleted === undefined) {}
     for (const todo of todos) {
       const isComplete = await todo.isCompleted();
killedBy: ListComponent should remove a todo by Id
statusReason: Expected 0 to equal 1.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:19:31
     if (isCompleted === undefined) {
       return todos;
     }
-    for (const todo of todos) {
-      const isComplete = await todo.isCompleted();
-      if (isComplete === isCompleted) todoList.push(todo);
-    }
+    for (const todo of todos) {}
     return todoList;
   }
killedBy: ListComponent should return a list of completed todos
statusReason: Expected 0 to equal 1.

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:21:11
     }
     for (const todo of todos) {
       const isComplete = await todo.isCompleted();
-      if (isComplete === isCompleted) todoList.push(todo);
+      if (true) todoList.push(todo);
     }
     return todoList;
killedBy: ListComponent should return a list of completed todos
statusReason: Expected 2 to equal 1.

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:21:11
     }
     for (const todo of todos) {
       const isComplete = await todo.isCompleted();
-      if (isComplete === isCompleted) todoList.push(todo);
+      if (false) todoList.push(todo);
     }
     return todoList;
killedBy: ListComponent should return a list of completed todos
statusReason: Expected 0 to equal 1.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:26:67
     return todoList;
   }
 
-  async getTodoById(id: string): Promise<ItemHarness | undefined> {
-    const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      const todoId = await todo.getId();
-      if (todoId === id) {
-        return todo;
-      }
-    }
-    return;
-  }
+  async getTodoById(id: string): Promise<ItemHarness | undefined> {}
 
   async getTodoDataById(id: string): Promise<TodoInterface | undefined> {
killedBy: ListComponent should check todo when unchecked
statusReason: Expected 1 to equal 0.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:28:34
 
   async getTodoById(id: string): Promise<ItemHarness | undefined> {
     const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      const todoId = await todo.getId();
-      if (todoId === id) {
-        return todo;
-      }
-    }
+    for (const todo of todoList) {}
     return;
   }
killedBy: ListComponent should remove a todo by Id
statusReason: Expected 1 to equal 0.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:30:26
     const todoList = await this.getTodos();
     for (const todo of todoList) {
       const todoId = await todo.getId();
-      if (todoId === id) {
-        return todo;
-      }
+      if (todoId === id) {}
     }
     return;
killedBy: ListComponent should remove a todo by Id
statusReason: Expected 1 to equal 0.

[Killed] EqualityOperator
app/components/list/list.component.harness.ts:30:11
     const todoList = await this.getTodos();
     for (const todo of todoList) {
       const todoId = await todo.getId();
-      if (todoId === id) {
+      if (todoId !== id) {
         return todo;
       }
killedBy: ListComponent should check todo when unchecked
statusReason: Expected 1 to equal 0.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:37:73
     return;
   }
 
-  async getTodoDataById(id: string): Promise<TodoInterface | undefined> {
-    const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      const todoId = await todo.getId();
-      if (todoId === id) {
-        const todoFound: TodoInterface = {
-          id,
-          name: await todo.getTodoLabel(),
-          completed: await todo.isCompleted()
-        };
-        return todoFound;
-      }
-    }
-    return;
-  }
+  async getTodoDataById(id: string): Promise<TodoInterface | undefined> {}
 
   async removeTodoById(id: string) {
killedBy: ListComponent should update a todo
statusReason: Expected undefined not to be undefined.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:39:34
 
   async getTodoDataById(id: string): Promise<TodoInterface | undefined> {
     const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      const todoId = await todo.getId();
-      if (todoId === id) {
-        const todoFound: TodoInterface = {
-          id,
-          name: await todo.getTodoLabel(),
-          completed: await todo.isCompleted()
-        };
-        return todoFound;
-      }
-    }
+    for (const todo of todoList) {}
     return;
   }
killedBy: ListComponent should update a todo
statusReason: Expected undefined not to be undefined.

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:41:11
     const todoList = await this.getTodos();
     for (const todo of todoList) {
       const todoId = await todo.getId();
-      if (todoId === id) {
+      if (false) {
         const todoFound: TodoInterface = {
           id,
killedBy: ListComponent should update a todo
statusReason: Expected undefined not to be undefined.

[Killed] ObjectLiteral
app/components/list/list.component.harness.ts:42:42
     for (const todo of todoList) {
       const todoId = await todo.getId();
       if (todoId === id) {
-        const todoFound: TodoInterface = {
-          id,
-          name: await todo.getTodoLabel(),
-          completed: await todo.isCompleted()
-        };
+        const todoFound: TodoInterface = {};
         return todoFound;
       }
killedBy: ListComponent should update a todo
statusReason: Expected object to have properties
    id: '1'
    name: 'Demo 2'
    completed: true

[NoCoverage] BlockStatement
app/components/list/list.component.harness.ts:58:26
     if (todo) await todo.remove();
   }
 
-  async removeAllTodos() {
-    const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      await todo.remove();
-    }
-  }
+  async removeAllTodos() {}
 
   async updateTodo(id: string, todo: UpdateTodo) {

[NoCoverage] BlockStatement
app/components/list/list.component.harness.ts:60:34
 
   async removeAllTodos() {
     const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      await todo.remove();
-    }
+    for (const todo of todoList) {}
   }
 

[Killed] BlockStatement
app/components/list/list.component.harness.ts:70:34
     if (todoItem) await todoItem.edit(todo);
   }
 
-  async markAllTodosAsComplete() {
-    const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      await todo.check();
-    }
-  }
+  async markAllTodosAsComplete() {}
 
   async areAllTodosCompleted(): Promise<boolean>{
killedBy: ListComponent should mark all todos as complete
statusReason: Expected false to be true.

[Survived] BlockStatement
app/components/list/list.component.harness.ts:72:34
 
   async markAllTodosAsComplete() {
     const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      await todo.check();
-    }
+    for (const todo of todoList) {}
   }
 

[Killed] BlockStatement
app/components/list/list.component.harness.ts:77:49
     }
   }
 
-  async areAllTodosCompleted(): Promise<boolean>{
-    const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      const isComplete = await todo.isCompleted();
-      if (!isComplete) return isComplete;
-    }
-    return true;
-  }
+  async areAllTodosCompleted(): Promise<boolean>{}
 }
 
killedBy: ListComponent should mark all todos as complete
statusReason: Expected undefined to be true.

[Killed] BlockStatement
app/components/list/list.component.harness.ts:79:34
 
   async areAllTodosCompleted(): Promise<boolean>{
     const todoList = await this.getTodos();
-    for (const todo of todoList) {
-      const isComplete = await todo.isCompleted();
-      if (!isComplete) return isComplete;
-    }
+    for (const todo of todoList) {}
     return true;
   }
killedBy: ListComponent should return false if all todos are not completed
statusReason: Expected true to be false.

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:81:11
     const todoList = await this.getTodos();
     for (const todo of todoList) {
       const isComplete = await todo.isCompleted();
-      if (!isComplete) return isComplete;
+      if (false) return isComplete;
     }
     return true;
killedBy: ListComponent should return false if all todos are not completed
statusReason: Expected true to be false.

[Killed] BooleanLiteral
app/components/list/list.component.harness.ts:81:11
     const todoList = await this.getTodos();
     for (const todo of todoList) {
       const isComplete = await todo.isCompleted();
-      if (!isComplete) return isComplete;
+      if (isComplete) return isComplete;
     }
     return true;
killedBy: ListComponent should return false if all todos are not completed
statusReason: Expected true to be false.
