[NoCoverage] StringLiteral
src/app/services/todo-local.service.ts:3:27
 import { TodoInterface } from './todo.interface';
 
-const LOCAL_STORAGE_KEY = 'todoapp_todos';
+const LOCAL_STORAGE_KEY = "";
 
 export class TodoLocalService {

[NoCoverage] LogicalOperator
src/app/services/todo-local.service.ts:7:23
 
 export class TodoLocalService {
   static loadTodos(): TodoInterface[] {
-    return JSON.parse(window.localStorage.getItem(LOCAL_STORAGE_KEY) || '[]');
+    return JSON.parse(window.localStorage.getItem(LOCAL_STORAGE_KEY) && '[]');
   }
 
