[Survived] ArrowFunction
app/store/todo/todo.reducer.ts:7:25
 import { onClearCompleted, onCompleteAll, onCreate, onLoad, onRemove, onUpdate } from './todo.action';
 import { selectCompleted, selectNotCompleted } from './todo.selector';
 
-const areAllCompleted = (state: ReadonlyArray<TodoInterface>) =>
-  state.length && selectCompleted(state).length === state.length;
+const areAllCompleted = () => undefined;
 
 export const createTodoReducer = (initialState: ReadonlyArray<TodoInterface>) =>

[Killed] EqualityOperator
app/store/todo/todo.reducer.ts:8:19
 import { selectCompleted, selectNotCompleted } from './todo.selector';
 
 const areAllCompleted = (state: ReadonlyArray<TodoInterface>) =>
-  state.length && selectCompleted(state).length === state.length;
+  state.length && selectCompleted(state).length !== state.length;
 
 export const createTodoReducer = (initialState: ReadonlyArray<TodoInterface>) =>
killedBy: TodoService should toggle all todos as completed
statusReason: Expected $[0].completed = false to equal true.
Expected $[1].completed = false to equal true.

[Killed] BooleanLiteral
app/store/todo/todo.reducer.ts:17:89
       return todos;
     }),
     on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
-      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: false }];
+      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: true }];
     }),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
killedBy: TodoService should get todo by Id; createStore should add new todo; HeaderComponent should add new todo to store
statusReason: Expected $.completed = true to equal false.

[Killed] ObjectLiteral
app/store/todo/todo.reducer.ts:17:25
       return todos;
     }),
     on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
-      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: false }];
+      return [...state, {}];
     }),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
killedBy: TodoService should get completed todos; createStore should add new todo; HeaderComponent should add new todo to store
statusReason: Expected object to have properties
    name: 'Demo'

[Killed] EqualityOperator
app/store/todo/todo.reducer.ts:23:35
       return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
     }),
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
-      return state.filter(todo => todo.id !== id);
+      return state.filter(todo => todo.id === id);
     }),
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
killedBy: TodoService should delete a todo by Id; ListComponent should remove a todo by Id; todosReducer should remove existing todo
statusReason: Expected Object({ id: '1', name: 'Demo', completed: false }) to be undefined.
