[Killed] ArrowFunction
app/store/todo/todo.selector.ts:26:3
 
 export const selectItemsLeft = createSelector(
   (state: TodoStateInterface) => state.todos,
-  (todos: ReadonlyArray<TodoInterface>) => selectNotCompleted(todos).length
+  () => undefined
 );
 
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: Expected 'items left' to be '0 items left'.

[Survived] ArrowFunction
app/store/todo/todo.selector.ts:31:3
 
 export const selectCompletedCount = createSelector(
   (state: TodoStateInterface) => state.todos,
-  (todos: ReadonlyArray<TodoInterface>) => selectCompleted(todos).length
+  () => undefined
 );
 

[NoCoverage] BlockStatement
app/store/todo/todo.selector.ts:34:74
   (todos: ReadonlyArray<TodoInterface>) => selectCompleted(todos).length
 );
 
-export const selectTodoById = (state: TodoStateInterface, id: string) => {
-  return state.todos.find(todo => todo.id === id);
-};
+export const selectTodoById = (state: TodoStateInterface, id: string) => {};
 
 export function selectNotCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {

[NoCoverage] ConditionalExpression
app/store/todo/todo.selector.ts:35:35
 );
 
 export const selectTodoById = (state: TodoStateInterface, id: string) => {
-  return state.todos.find(todo => todo.id === id);
+  return state.todos.find(todo => true);
 };
 

[NoCoverage] EqualityOperator
app/store/todo/todo.selector.ts:35:35
 );
 
 export const selectTodoById = (state: TodoStateInterface, id: string) => {
-  return state.todos.find(todo => todo.id === id);
+  return state.todos.find(todo => todo.id !== id);
 };
 

[Survived] ArrowFunction
app/store/todo/todo.selector.ts:39:23
 };
 
 export function selectNotCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => !todo.completed);
+  return todos.filter(() => undefined);
 }
 
