[Killed] BlockStatement
app/components/header/header.component.harness.ts:8:46
 
   private _addTodo = this.locatorFor('input');
 
-  async addTodo(name: string): Promise<void> {
-    const input = await this._addTodo();
-    await input.sendKeys(name, TestKey.ENTER);
-  }
+  async addTodo(name: string): Promise<void> {}
 }
 
killedBy: HeaderComponent should add new todo to store
statusReason: Expected $[0].length = 0 to equal 1.
Expected $[0][0] = undefined to equal Object({ id: <jasmine.any(String)>, name: 'Demo', completed: false }).
