[Killed] StringLiteral
app/components/header/header.component.ts:6:19
 import { TodoStateInterface } from '../../store/todo-state.interface';
 import { onCreate } from '../../store/todo/todo.action';
 
-const ENTER_KEY = 'Enter';
+const ENTER_KEY = "";
 
 @Component({
killedBy: HeaderComponent should add new todo to store
statusReason: Expected $[0].length = 0 to equal 1.
Expected $[0][0] = undefined to equal Object({ id: <jasmine.any(String)>, name: 'Demo', completed: false }).

[Survived] BlockStatement
app/components/header/header.component.ts:33:38
     this.name = (event.target as HTMLInputElement).value;
   }
 
-  handleSubmit(event: KeyboardEvent) {
-    if (event.key !== ENTER_KEY) {
-      return;
-    }
-
-    this.store.dispatch(onCreate({ id: '1', name: this.name }));
-    this.name = '';
-  }
+  handleSubmit(event: KeyboardEvent) {}
 }
 

[Killed] ConditionalExpression
app/components/header/header.component.ts:34:9
   }
 
   handleSubmit(event: KeyboardEvent) {
-    if (event.key !== ENTER_KEY) {
+    if (false) {
       return;
     }
killedBy: HeaderComponent should add new todo to store
statusReason: Expected $[0].length = 5 to equal 1.
Expected $[0][0].name = 'D' to equal 'Demo'.
Unexpected $[0][1] = Object({ id: '1', name: 'De', completed: false }) in array.
Unexpected $[0][2] = Object({ id: '1', name: 'Dem', completed: false }) in array.
Unexpected $[0][3] = Object({ id: '1', name: 'Demo', completed: false }) in array.
Unexpected $[0][4] = Object({ id: '1', name: '', completed: false }) in

[Killed] ObjectLiteral
app/components/header/header.component.ts:38:34
       return;
     }
 
-    this.store.dispatch(onCreate({ id: '1', name: this.name }));
+    this.store.dispatch(onCreate({}));
     this.name = '';
   }
killedBy: HeaderComponent should add new todo to store
statusReason: Expected $[0][0].name = undefined to equal 'Demo'.
