[Survived] ConditionalExpression
app/components/item/item.component.ts:37:9
   update = new EventEmitter<TodoInterface>();
 
   ngOnChanges(changes: SimpleChanges) {
-    if (changes.todo) {
+    if (true) {
       this.name = changes.todo.currentValue.name;
     }

[Killed] BlockStatement
app/components/item/item.component.ts:46:16
     this.remove.emit(this.todo.id);
   }
 
-  handleBlur() {
-    this.update.emit({ id: this.todo.id, name: this.name });
-    this.editing = false;
-  }
+  handleBlur() {}
 
   handleEdit() {
killedBy: ListComponent should update a todo
statusReason: Expected $.name = 'Demo' to equal 'Demo 2'.

[Killed] ObjectLiteral
app/components/item/item.component.ts:47:22
   }
 
   handleBlur() {
-    this.update.emit({ id: this.todo.id, name: this.name });
+    this.update.emit({});
     this.editing = false;
   }
killedBy: ListComponent should update a todo
statusReason: Expected $.name = 'Demo' to equal 'Demo 2'.

[Survived] BooleanLiteral
app/components/item/item.component.ts:48:20
 
   handleBlur() {
     this.update.emit({ id: this.todo.id, name: this.name });
-    this.editing = false;
+    this.editing = true;
   }
 

[Killed] BlockStatement
app/components/item/item.component.ts:55:21
     this.editing = true;
   }
 
-  handleCompleted() {
-    this.update.emit({ id: this.todo.id, completed: !this.todo.completed });
-  }
+  handleCompleted() {}
 }
 
killedBy: ItemComponent should mark todo item as completed
statusReason: Expected true to equal false.

[Killed] BooleanLiteral
app/components/item/item.component.ts:56:53
   }
 
   handleCompleted() {
-    this.update.emit({ id: this.todo.id, completed: !this.todo.completed });
+    this.update.emit({ id: this.todo.id, completed: this.todo.completed });
   }
 }
killedBy: ItemComponent should mark todo item as completed; ListComponent should update a todo
statusReason: Expected false to equal true.

[Killed] ObjectLiteral
app/components/item/item.component.ts:56:22
   }
 
   handleCompleted() {
-    this.update.emit({ id: this.todo.id, completed: !this.todo.completed });
+    this.update.emit({});
   }
 }
killedBy: ItemComponent should mark todo item as completed; ListComponent should update a todo
statusReason: Expected undefined to equal true.
