[Killed] ArrowFunction
src/app/services/todo.service.ts:24:57
   }
 
   getTodoById(id: string): Observable<Readonly<TodoInterface | undefined>> {
-    return this.getTodos().pipe(map(todos => todos.find(todo => todo.id === id)));
+    return this.getTodos().pipe(map(todos => todos.find(() => undefined)));
   }
 
killedBy: TodoService should get todo by Id
statusReason: Expected undefined to equal Object({ id: <jasmine.any(String)>, name: 'Demo', completed: false }).

[Survived] MethodExpression
src/app/services/todo.service.ts:36:46
   }
 
   getCompletedTodos(): Observable<ReadonlyArray<TodoInterface>> {
-    return this.getTodos().pipe(map(todos => todos.filter(todo => todo.completed)));
+    return this.getTodos().pipe(map(todos => todos));
   }
 

[Killed] ArrowFunction
src/app/services/todo.service.ts:40:59
   }
 
   completedTodos(): Observable<boolean> {
-    return this.store.select(selectAllCompleted).pipe(map(completed => !!completed));
+    return this.store.select(selectAllCompleted).pipe(map(() => undefined));
   }
 
killedBy: TodoService should indicate if all todos are complete
statusReason: Expected undefined to equal true.
