[Killed] ArrowFunction
app/store/filter/filter.action.ts:4:71
 import { createAction } from '@ngrx/store';
 import { ACTION_TYPES } from '../../constants/action-type';
 
-export const onFilterSelect = createAction(ACTION_TYPES.selectFilter, (filter: string) => ({ filter }));
+export const onFilterSelect = createAction(ACTION_TYPES.selectFilter, () => undefined);
 
killedBy: FooterComponent should have the "Active" filter selected
statusReason: Expected false to be true.
