[Killed] ArrowFunction
app/store/filter/filter.reducer.ts:5:36
 import { FILTERS } from '../../constants/filter';
 import { onFilterSelect } from './filter.action';
 
-export const createFilterReducer = (initialState: string = FILTERS.all) =>
-  createReducer(
-    initialState,
-    on(onFilterSelect, (_state, { filter }) => {
-      return filter;
-    })
-  );
+export const createFilterReducer = () => undefined;
 
killedBy: createStore should create a new instance of store; FooterComponent should have the "All" filter active by default
statusReason: Expected $[0].notification.value = undefined to equal 'all'.
