[Killed] ArrowFunction
app/store/todo/todo.action.ts:5:55
 import { ACTION_TYPES } from '../../constants/action-type';
 import { TodoInterface } from '../../services/todo.interface';
 
-export const onLoad = createAction(ACTION_TYPES.load, (todos: TodoInterface[]) => ({ todos }));
+export const onLoad = createAction(ACTION_TYPES.load, () => undefined);
 
 export const onCreate = createAction(ACTION_TYPES.create, (todo: Omit<TodoInterface, "completed">) => ({ todo }));
killedBy: todosReducer should set list of items on load
statusReason: Expected undefined to equal [ Object({ id: 'e2bb892a', name: 'Demo', completed: false }) ].

[Killed] ArrowFunction
app/store/todo/todo.action.ts:9:59
 
 export const onCreate = createAction(ACTION_TYPES.create, (todo: Omit<TodoInterface, "completed">) => ({ todo }));
 
-export const onRemove = createAction(ACTION_TYPES.remove, (id: string) => ({ id }));
+export const onRemove = createAction(ACTION_TYPES.remove, () => undefined);
 
 export const onUpdate = createAction(ACTION_TYPES.update, (values: TodoInterface) => ({ values }));
killedBy: TodoService should delete a todo by Id; ListComponent should remove a todo by Id; todosReducer should remove existing todo
statusReason: Expected Object({ id: '1', name: 'Demo', completed: false }) to be undefined.
