[Survived] StringLiteral
src/app/constants/action-type.ts:6:16
   create: 'CREATE',
   remove: 'REMOVE',
   update: 'UPDATE',
-  completeAll: 'COMPLETE_ALL',
+  completeAll: "",
   clearCompleted: 'CLEAR_COMPLETED',
   selectFilter: 'SELECT_FILTER'

[Survived] StringLiteral
src/app/constants/action-type.ts:7:19
   remove: 'REMOVE',
   update: 'UPDATE',
   completeAll: 'COMPLETE_ALL',
-  clearCompleted: 'CLEAR_COMPLETED',
+  clearCompleted: "",
   selectFilter: 'SELECT_FILTER'
 };
