[Killed] ObjectLiteral
src/app/constants/filter.ts:10:24
   value: FilterTypes;
 };
 
-export const FILTERS = {
-  all: 'all',
-  active: 'active',
-  completed: 'completed'
-};
+export const FILTERS = {};
 
killedBy: TodoService should add a todo; FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Expected $[0].notification.value = undefined to equal 'all'.
