[Killed] ArrowFunction
app/store/filter/filter.selector.ts:3:29
 import { createSelector } from '@ngrx/store';
 
-export const selectFilter = (state: { filter: string }) => state.filter;
+export const selectFilter = () => undefined;
 
killedBy: FooterComponent should have the "All" filter active by default
statusReason: Expected false to be true.
