[NoCoverage] ObjectLiteral
src/app/app.config.ts:5:45
 import { provideStore } from '@ngrx/store';
 import { createStore } from './store';
 
-export const appConfig: ApplicationConfig = {
-  providers: [provideStore(createStore())]
-};
+export const appConfig: ApplicationConfig = {};
 
