[Killed] BlockStatement
app/components/app/app.component.harness.ts:16:45
   #footerHarness = this.locatorForOptional(FooterHarness);
   #copyRightHarness = this.locatorFor(CopyRightHarness);
 
-  async getHeader(): Promise<HeaderHarness> {
-    return await this.#headerHarness();
-  }
+  async getHeader(): Promise<HeaderHarness> {}
 
   async getList(): Promise<ListHarness | null> {
killedBy: AppComponent should return HeaderHarness
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Timeout] BlockStatement
app/components/app/app.component.harness.ts:20:48
     return await this.#headerHarness();
   }
 
-  async getList(): Promise<ListHarness | null> {
-    return await this.#listHarness();
-  }
+  async getList(): Promise<ListHarness | null> {}
 
   async getFooter(): Promise<FooterHarness | null> {

[Killed] BlockStatement
app/components/app/app.component.harness.ts:24:52
     return await this.#listHarness();
   }
 
-  async getFooter(): Promise<FooterHarness | null> {
-    return await this.#footerHarness();
-  }
+  async getFooter(): Promise<FooterHarness | null> {}
 
   async getCopyright(): Promise<CopyRightHarness> {
killedBy: AppComponent should return a FooterHarness
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
app/components/app/app.component.harness.ts:28:51
     return await this.#footerHarness();
   }
 
-  async getCopyright(): Promise<CopyRightHarness> {
-    return await this.#copyRightHarness();
-  }
+  async getCopyright(): Promise<CopyRightHarness> {}
 
   async addTodo(name: string): Promise<void> {
killedBy: AppComponent should return a CopyRightHarness
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
app/components/app/app.component.harness.ts:32:46
     return await this.#copyRightHarness();
   }
 
-  async addTodo(name: string): Promise<void> {
-    const header = await this.#headerHarness();
-    await header.addTodo(name);
-  }
+  async addTodo(name: string): Promise<void> {}
 
   async updateTodo(todo: UpdateTodo) {
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   Object {
-     "completed": false,

[Killed] BlockStatement
app/components/app/app.component.harness.ts:37:38
     await header.addTodo(name);
   }
 
-  async updateTodo(todo: UpdateTodo) {
-    const list = await this.#listHarness();
-    if (list !== null) {
-      const { id } = todo;
-      const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved !== undefined) await todoRetrieved.edit(todo);
-    }
-  }
+  async updateTodo(todo: UpdateTodo) {}
 
   async deleteTodo(id: string) {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:39:9
 
   async updateTodo(todo: UpdateTodo) {
     const list = await this.#listHarness();
-    if (list !== null) {
+    if (false) {
       const { id } = todo;
       const todoRetrieved = await list.getTodoById(id);
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/app/app.component.harness.ts:39:24
 
   async updateTodo(todo: UpdateTodo) {
     const list = await this.#listHarness();
-    if (list !== null) {
-      const { id } = todo;
-      const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved !== undefined) await todoRetrieved.edit(todo);
-    }
+    if (list !== null) {}
   }
 
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:42:11
     if (list !== null) {
       const { id } = todo;
       const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved !== undefined) await todoRetrieved.edit(todo);
+      if (false) await todoRetrieved.edit(todo);
     }
   }
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] EqualityOperator
app/components/app/app.component.harness.ts:42:11
     if (list !== null) {
       const { id } = todo;
       const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved !== undefined) await todoRetrieved.edit(todo);
+      if (todoRetrieved === undefined) await todoRetrieved.edit(todo);
     }
   }
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/app/app.component.harness.ts:46:32
     }
   }
 
-  async deleteTodo(id: string) {
-    const list = await this.#listHarness();
-    if (list) {
-      const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved) await todoRetrieved.remove();
-    }
-  }
+  async deleteTodo(id: string) {}
 
   async deleteTodos() {
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
app/components/app/app.component.harness.ts:48:15
 
   async deleteTodo(id: string) {
     const list = await this.#listHarness();
-    if (list) {
-      const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved) await todoRetrieved.remove();
-    }
+    if (list) {}
   }
 
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:48:9
 
   async deleteTodo(id: string) {
     const list = await this.#listHarness();
-    if (list) {
+    if (false) {
       const todoRetrieved = await list.getTodoById(id);
       if (todoRetrieved) await todoRetrieved.remove();
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:50:11
     const list = await this.#listHarness();
     if (list) {
       const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved) await todoRetrieved.remove();
+      if (false) await todoRetrieved.remove();
     }
   }
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Survived] ConditionalExpression
app/components/app/app.component.harness.ts:50:11
     const list = await this.#listHarness();
     if (list) {
       const todoRetrieved = await list.getTodoById(id);
-      if (todoRetrieved) await todoRetrieved.remove();
+      if (true) await todoRetrieved.remove();
     }
   }

[Killed] BlockStatement
app/components/app/app.component.harness.ts:54:23
     }
   }
 
-  async deleteTodos() {
-    const list = await this.#listHarness();
-    if (list) await list.removeAllTodos();
-  }
+  async deleteTodos() {}
 
   async markAllTodosAsComplete() {
killedBy: AppComponent should delete all todos
statusReason: Error: expect(received).toBeNull()

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:56:9
 
   async deleteTodos() {
     const list = await this.#listHarness();
-    if (list) await list.removeAllTodos();
+    if (false) await list.removeAllTodos();
   }
 
killedBy: AppComponent should delete all todos
statusReason: Error: expect(received).toBeNull()

[Survived] ConditionalExpression
app/components/app/app.component.harness.ts:56:9
 
   async deleteTodos() {
     const list = await this.#listHarness();
-    if (list) await list.removeAllTodos();
+    if (true) await list.removeAllTodos();
   }
 

[Killed] BlockStatement
app/components/app/app.component.harness.ts:59:34
     if (list) await list.removeAllTodos();
   }
 
-  async markAllTodosAsComplete() {
-    const todoList = await this.#listHarness();
-    if (todoList) await todoList.markAllTodosAsComplete();
-  }
+  async markAllTodosAsComplete() {}
 
   async markAsComplete(id: string) {
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:61:9
 
   async markAllTodosAsComplete() {
     const todoList = await this.#listHarness();
-    if (todoList) await todoList.markAllTodosAsComplete();
+    if (false) await todoList.markAllTodosAsComplete();
   }
 
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Survived] ConditionalExpression
app/components/app/app.component.harness.ts:61:9
 
   async markAllTodosAsComplete() {
     const todoList = await this.#listHarness();
-    if (todoList) await todoList.markAllTodosAsComplete();
+    if (true) await todoList.markAllTodosAsComplete();
   }
 

[Killed] BlockStatement
app/components/app/app.component.harness.ts:64:36
     if (todoList) await todoList.markAllTodosAsComplete();
   }
 
-  async markAsComplete(id: string) {
-    const list = await this.#listHarness();
-    if (list) {
-      const todoRetrieved = await list.getTodoById(id);
-      if(!todoRetrieved) throw Error(`Failed to find todo with id ${id}`);
-      return todoRetrieved.check();
-    }
-  }
+  async markAsComplete(id: string) {}
 
   async getTodos() {
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,10 +3,10 @@
      "completed": false,
      "id": "1",

[Killed] BlockStatement
app/components/app/app.component.harness.ts:66:15
 
   async markAsComplete(id: string) {
     const list = await this.#listHarness();
-    if (list) {
-      const todoRetrieved = await list.getTodoById(id);
-      if(!todoRetrieved) throw Error(`Failed to find todo with id ${id}`);
-      return todoRetrieved.check();
-    }
+    if (list) {}
   }
 
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,10 +3,10 @@
      "completed": false,
      "id": "1",

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:68:10
     const list = await this.#listHarness();
     if (list) {
       const todoRetrieved = await list.getTodoById(id);
-      if(!todoRetrieved) throw Error(`Failed to find todo with id ${id}`);
+      if(true) throw Error(`Failed to find todo with id ${id}`);
       return todoRetrieved.check();
     }
killedBy: AppComponent should mark single todo by Id
statusReason: Error: Failed to find todo with id 2

[Killed] BooleanLiteral
app/components/app/app.component.harness.ts:68:10
     const list = await this.#listHarness();
     if (list) {
       const todoRetrieved = await list.getTodoById(id);
-      if(!todoRetrieved) throw Error(`Failed to find todo with id ${id}`);
+      if(todoRetrieved) throw Error(`Failed to find todo with id ${id}`);
       return todoRetrieved.check();
     }
killedBy: AppComponent should mark single todo by Id
statusReason: Error: Failed to find todo with id 2

[Killed] BlockStatement
app/components/app/app.component.harness.ts:73:20
     }
   }
 
-  async getTodos() {
-    const listHarness = await this.#listHarness();
-    return listHarness ? await listHarness.getTodos() : [];
-  }
+  async getTodos() {}
 
   async getTodosData() {
killedBy: AppComponent should delete a single todo by Id
statusReason: TypeError: (intermediate value) is not iterable

[Killed] ArrayDeclaration
app/components/app/app.component.harness.ts:75:57
 
   async getTodos() {
     const listHarness = await this.#listHarness();
-    return listHarness ? await listHarness.getTodos() : [];
+    return listHarness ? await listHarness.getTodos() : ["Stryker was here"];
   }
 
killedBy: AppComponent should return an empty array for no todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
app/components/app/app.component.harness.ts:78:24
     return listHarness ? await listHarness.getTodos() : [];
   }
 
-  async getTodosData() {
-    const listHarness = await this.#listHarness();
-    return listHarness ? await listHarness.getTodoData() : [];
-  }
+  async getTodosData() {}
 
   async viewActiveTodos() {
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"completed": false, "id": Any<String>, "name": "Test001"}, {"completed": false, "id": Any<String>, "name": "Test002"}]
Received: undefined

[Killed] BlockStatement
app/components/app/app.component.harness.ts:83:27
     return listHarness ? await listHarness.getTodoData() : [];
   }
 
-  async viewActiveTodos() {
-    const footerHarness = await this.#footerHarness();
-    if (!footerHarness) throw Error('Footer not found');
-    await footerHarness.clickFilter('Active');
-  }
+  async viewActiveTodos() {}
 
   async viewAllTodos() {
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,

[Killed] ConditionalExpression
app/components/app/app.component.harness.ts:85:9
 
   async viewActiveTodos() {
     const footerHarness = await this.#footerHarness();
-    if (!footerHarness) throw Error('Footer not found');
+    if (true) throw Error('Footer not found');
     await footerHarness.clickFilter('Active');
   }
killedBy: AppComponent should display active todos
statusReason: Error: Footer not found

[Killed] BooleanLiteral
app/components/app/app.component.harness.ts:85:9
 
   async viewActiveTodos() {
     const footerHarness = await this.#footerHarness();
-    if (!footerHarness) throw Error('Footer not found');
+    if (footerHarness) throw Error('Footer not found');
     await footerHarness.clickFilter('Active');
   }
killedBy: AppComponent should display active todos
statusReason: Error: Footer not found

[NoCoverage] BlockStatement
app/components/app/app.component.harness.ts:89:24
     await footerHarness.clickFilter('Active');
   }
 
-  async viewAllTodos() {
-    const footerHarness = await this.#footerHarness();
-    if (!footerHarness) throw Error('Footer not found');
-    await footerHarness.clickFilter('All');
-  }
+  async viewAllTodos() {}
 
   async viewCompletedTodos() {

[NoCoverage] ConditionalExpression
app/components/app/app.component.harness.ts:91:9
 
   async viewAllTodos() {
     const footerHarness = await this.#footerHarness();
-    if (!footerHarness) throw Error('Footer not found');
+    if (false) throw Error('Footer not found');
     await footerHarness.clickFilter('All');
   }

[NoCoverage] StringLiteral
app/components/app/app.component.harness.ts:92:37
   async viewAllTodos() {
     const footerHarness = await this.#footerHarness();
     if (!footerHarness) throw Error('Footer not found');
-    await footerHarness.clickFilter('All');
+    await footerHarness.clickFilter("");
   }
 

[Killed] BlockStatement
app/components/app/app.component.harness.ts:95:30
     await footerHarness.clickFilter('All');
   }
 
-  async viewCompletedTodos() {
-    const footerHarness = await this.#footerHarness();
-    if (!footerHarness) throw Error('Footer not found');
-    await footerHarness.clickFilter('Completed');
-  }
+  async viewCompletedTodos() {}
 }
 
killedBy: AppComponent should show completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -2,6 +2,11 @@
    Object {
      "completed": true,
