[Killed] StringLiteral
app/components/footer/footer.component.harness.ts:8:32
 export class FooterHarness extends ComponentHarness {
   static readonly hostSelector = 'app-footer';
 
-  #todoCount = this.locatorFor('.todo-count strong');
+  #todoCount = this.locatorFor("");
   #todoCountText = this.locatorFor('.todo-count');
   #clearCompleted = this.locatorForOptional('.clear-completed');
killedBy: FooterComponent should return the total amount of todos left
statusReason: SyntaxError: '' is not a valid selector

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:13:41
   #clearCompleted = this.locatorForOptional('.clear-completed');
   #filters = this.locatorForAll('.filters a');
 
-  async getTodoCount(): Promise<number> {
-    const todoCountEl = await this.#todoCount();
-    const count = await todoCountEl.text();
-    return +count;
-  }
+  async getTodoCount(): Promise<number> {}
 
   async getTodoCountText(): Promise<string> { 
killedBy: FooterComponent should return the total amount of todos left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] UnaryOperator
app/components/footer/footer.component.harness.ts:16:12
   async getTodoCount(): Promise<number> {
     const todoCountEl = await this.#todoCount();
     const count = await todoCountEl.text();
-    return +count;
+    return -count;
   }
 
killedBy: FooterComponent should return the total amount of todos left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -0

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:19:45
     return +count;
   }
 
-  async getTodoCountText(): Promise<string> { 
-    const todoCountEl = await this.#todoCountText();
-    return await todoCountEl.text();
-  }
+  async getTodoCountText(): Promise<string> {}
 
   async clearCompleted(): Promise<void> {
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0 items left"
Received: undefined

[Survived] BlockStatement
app/components/footer/footer.component.harness.ts:24:41
     return await todoCountEl.text();
   }
 
-  async clearCompleted(): Promise<void> {
-    const clearCompletedEl = await this.#clearCompleted();
-    if (clearCompletedEl) {
-      await clearCompletedEl.click();
-    }
-  }
+  async clearCompleted(): Promise<void> {}
 
   async getFilters(): Promise<FilterTypes[]> {

[Killed] ConditionalExpression
app/components/footer/footer.component.harness.ts:26:9
 
   async clearCompleted(): Promise<void> {
     const clearCompletedEl = await this.#clearCompleted();
-    if (clearCompletedEl) {
+    if (true) {
       await clearCompletedEl.click();
     }
killedBy: FooterComponent should clear all completed todos
statusReason: TypeError: Cannot read properties of null (reading 'click')

[Survived] ConditionalExpression
app/components/footer/footer.component.harness.ts:26:9
 
   async clearCompleted(): Promise<void> {
     const clearCompletedEl = await this.#clearCompleted();
-    if (clearCompletedEl) {
+    if (false) {
       await clearCompletedEl.click();
     }

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:31:46
     }
   }
 
-  async getFilters(): Promise<FilterTypes[]> {
-    const filters = await this.#filters();
-    return await parallel(() =>
-      filters.map(async filterEl => {
-        const text = await filterEl.text();
-        return text as FilterTypes;
-      })
-    );
-  }
+  async getFilters(): Promise<FilterTypes[]> {}
 
   async clickFilter(filterText: FilterTypes): Promise<void> {
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["All", "Active", "Completed"]
Received: undefined

[Killed] ArrowFunction
app/components/footer/footer.component.harness.ts:33:27
 
   async getFilters(): Promise<FilterTypes[]> {
     const filters = await this.#filters();
-    return await parallel(() =>
-      filters.map(async filterEl => {
-        const text = await filterEl.text();
-        return text as FilterTypes;
-      })
+    return await parallel(() => undefined
     );
   }
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:34:37
   async getFilters(): Promise<FilterTypes[]> {
     const filters = await this.#filters();
     return await parallel(() =>
-      filters.map(async filterEl => {
-        const text = await filterEl.text();
-        return text as FilterTypes;
-      })
+      filters.map(async filterEl => {})
     );
   }
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   "All",
-   "Active",

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:41:61
     );
   }
 
-  async clickFilter(filterText: FilterTypes): Promise<void> {
-    const filters = await this.#filters();
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) {
-        await filter.click();
-      }
-    }
-  }
+  async clickFilter(filterText: FilterTypes): Promise<void> {}
 
   async isFilterSelected(filterText: FilterTypes): Promise<boolean> {
killedBy: FooterComponent should have the "Active" filter selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:43:35
 
   async clickFilter(filterText: FilterTypes): Promise<void> {
     const filters = await this.#filters();
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) {
-        await filter.click();
-      }
-    }
+    for (const filter of filters) {}
   }
 
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,

[Killed] EqualityOperator
app/components/footer/footer.component.harness.ts:45:11
     const filters = await this.#filters();
     for (const filter of filters) {
       const text = await filter.text();
-      if (text === filterText) {
+      if (text !== filterText) {
         await filter.click();
       }
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": false,

[Killed] ConditionalExpression
app/components/footer/footer.component.harness.ts:45:11
     const filters = await this.#filters();
     for (const filter of filters) {
       const text = await filter.text();
-      if (text === filterText) {
+      if (false) {
         await filter.click();
       }
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:51:69
     }
   }
 
-  async isFilterSelected(filterText: FilterTypes): Promise<boolean> {
-    const filters = await this.#filters();
-    let selected: TestElement | null = null;
-
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) { 
-        selected = filter;
-      }
-    }
-    
-    return selected ? selected.hasClass("selected") : false;
-  }
+  async isFilterSelected(filterText: FilterTypes): Promise<boolean> {}
 }
 
killedBy: FooterComponent should have the "All" filter active by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:55:35
     const filters = await this.#filters();
     let selected: TestElement | null = null;
 
-    for (const filter of filters) {
-      const text = await filter.text();
-      if (text === filterText) { 
-        selected = filter;
-      }
-    }
+    for (const filter of filters) {}
     
     return selected ? selected.hasClass("selected") : false;
killedBy: FooterComponent should have the "All" filter active by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
app/components/footer/footer.component.harness.ts:57:32
 
     for (const filter of filters) {
       const text = await filter.text();
-      if (text === filterText) { 
-        selected = filter;
-      }
+      if (text === filterText) {}
     }
     
killedBy: FooterComponent should have the "All" filter active by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BooleanLiteral
app/components/footer/footer.component.harness.ts:62:55
       }
     }
     
-    return selected ? selected.hasClass("selected") : false;
+    return selected ? selected.hasClass("selected") : true;
   }
 }
