[Killed] StringLiteral
app/components/footer/footer.component.ts:39:26
 })
 export class FooterComponent {
   filterTitles: FiltersObj[] = [
-    { key: 'all', value: 'All' },
+    { key: 'all', value: "" },
     { key: 'active', value: 'Active' },
     { key: 'completed', value: 'Completed' }
killedBy: FooterComponent should have 3 filters "All", "Active" and "Completed"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "All",
+   "",

[Killed] StringLiteral
app/components/footer/footer.component.ts:40:29
 export class FooterComponent {
   filterTitles: FiltersObj[] = [
     { key: 'all', value: 'All' },
-    { key: 'active', value: 'Active' },
+    { key: 'active', value: "" },
     { key: 'completed', value: 'Completed' }
   ];
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,

[Killed] ObjectLiteral
app/components/footer/footer.component.ts:41:5
   filterTitles: FiltersObj[] = [
     { key: 'all', value: 'All' },
     { key: 'active', value: 'Active' },
-    { key: 'completed', value: 'Completed' }
+    {}
   ];
 
killedBy: AppComponent should show completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -2,6 +2,16 @@
    Object {
      "completed": true,

[Killed] StringLiteral
app/components/footer/footer.component.ts:41:12
   filterTitles: FiltersObj[] = [
     { key: 'all', value: 'All' },
     { key: 'active', value: 'Active' },
-    { key: 'completed', value: 'Completed' }
+    { key: "", value: 'Completed' }
   ];
 
killedBy: AppComponent should show completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

@@ -2,6 +2,16 @@
    Object {
      "completed": true,

[Killed] BlockStatement
app/components/footer/footer.component.ts:52:57
 
   filter$: Observable<string>;
 
-  constructor(private store: Store<TodoStateInterface>) {
-    this.itemsLeft$ = store.select(selectItemsLeft);
-    this.completedCount$ = store.select(selectCompletedCount);
-    this.itemText$ = store.select((state: TodoStateInterface) => (selectItemsLeft(state) === 1 ? 'item' : 'items'));
-    this.filter$ = store.select(selectFilter);
-  }
+  constructor(private store: Store<TodoStateInterface>) {}
 
   handleClearCompleted() {
killedBy: FooterComponent should have the "All" filter active by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
app/components/footer/footer.component.ts:55:35
   constructor(private store: Store<TodoStateInterface>) {
     this.itemsLeft$ = store.select(selectItemsLeft);
     this.completedCount$ = store.select(selectCompletedCount);
-    this.itemText$ = store.select((state: TodoStateInterface) => (selectItemsLeft(state) === 1 ? 'item' : 'items'));
+    this.itemText$ = store.select(() => undefined);
     this.filter$ = store.select(selectFilter);
   }
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0 items left"
Received: "0  left"

[Killed] EqualityOperator
app/components/footer/footer.component.ts:55:67
   constructor(private store: Store<TodoStateInterface>) {
     this.itemsLeft$ = store.select(selectItemsLeft);
     this.completedCount$ = store.select(selectCompletedCount);
-    this.itemText$ = store.select((state: TodoStateInterface) => (selectItemsLeft(state) === 1 ? 'item' : 'items'));
+    this.itemText$ = store.select((state: TodoStateInterface) => (selectItemsLeft(state) !== 1 ? 'item' : 'items'));
     this.filter$ = store.select(selectFilter);
   }
killedBy: FooterComponent should return the total amount of todos left in the form of text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0 items left"
Received: "0 item left"

[NoCoverage] BlockStatement
app/components/footer/footer.component.ts:59:26
     this.filter$ = store.select(selectFilter);
   }
 
-  handleClearCompleted() {
-    this.store.dispatch(onClearCompleted());
-  }
+  handleClearCompleted() {}
 
   async handleFilterSelect(filter: Filters, event: Event) {

[Killed] BlockStatement
app/components/footer/footer.component.ts:63:59
     this.store.dispatch(onClearCompleted());
   }
 
-  async handleFilterSelect(filter: Filters, event: Event) {
-    event.preventDefault();
-    this.store.dispatch(onFilterSelect(filter));
-  }
+  async handleFilterSelect(filter: Filters, event: Event) {}
 }
 
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,
