[Killed] BlockStatement
app/components/item/item.component.harness.ts:14:33
   #editInput = this.locatorForOptional('.edit');
   #remove = this.locatorFor('.destroy');
 
-  async toggle(): Promise<void> {
-    const toggle = await this.#toggle();
-    await toggle.click();
-  }
+  async toggle(): Promise<void> {}
 
   async check(): Promise<void> {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/item/item.component.harness.ts:19:32
     await toggle.click();
   }
 
-  async check(): Promise<void> {
-    const isChecked = await this.isCompleted();
-    if (!isChecked) {
-      await this.toggle();
-    }
-  }
+  async check(): Promise<void> {}
 
   async uncheck(): Promise<void> {
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,10 +3,10 @@
      "completed": false,
      "id": "1",

[Killed] BooleanLiteral
app/components/item/item.component.harness.ts:21:9
 
   async check(): Promise<void> {
     const isChecked = await this.isCompleted();
-    if (!isChecked) {
+    if (isChecked) {
       await this.toggle();
     }
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,10 +3,10 @@
      "completed": false,
      "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:21:21
 
   async check(): Promise<void> {
     const isChecked = await this.isCompleted();
-    if (!isChecked) {
-      await this.toggle();
-    }
+    if (!isChecked) {}
   }
 
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,10 +3,10 @@
      "completed": false,
      "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:26:34
     }
   }
 
-  async uncheck(): Promise<void> {
-    const isChecked = await this.isCompleted();
-    if (isChecked) {
-      await this.toggle();
-    }
-  }
+  async uncheck(): Promise<void> {}
 
   async getId(): Promise<string> {
killedBy: ItemComponent should uncheck todo item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] ConditionalExpression
app/components/item/item.component.harness.ts:28:9
 
   async uncheck(): Promise<void> {
     const isChecked = await this.isCompleted();
-    if (isChecked) {
+    if (false) {
       await this.toggle();
     }
killedBy: ItemComponent should uncheck todo item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
app/components/item/item.component.harness.ts:28:20
 
   async uncheck(): Promise<void> {
     const isChecked = await this.isCompleted();
-    if (isChecked) {
-      await this.toggle();
-    }
+    if (isChecked) {}
   }
 
killedBy: ItemComponent should uncheck todo item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
app/components/item/item.component.harness.ts:33:34
     }
   }
 
-  async getId(): Promise<string> {
-    const label = await this.#todoLabel();
-    const id = await label.getAttribute('id');
-    return id ?? '';
-  }
+  async getId(): Promise<string> {}
 
   async getTodoLabel(): Promise<string> {
killedBy: ListComponent should edit a todo and mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
-   "id": "1",

[Killed] LogicalOperator
app/components/item/item.component.harness.ts:36:12
   async getId(): Promise<string> {
     const label = await this.#todoLabel();
     const id = await label.getAttribute('id');
-    return id ?? '';
+    return id && '';
   }
 
killedBy: ListComponent should edit a todo and mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
-   "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:39:41
     return id ?? '';
   }
 
-  async getTodoLabel(): Promise<string> {
-    const label = await this.#todoLabel();
-    return label.text();
-  }
+  async getTodoLabel(): Promise<string> {}
 
   async isCompleted(): Promise<boolean> {
killedBy: ListComponent should edit a todo and mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
    "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:44:41
     return label.text();
   }
 
-  async isCompleted(): Promise<boolean> {
-    const toggle = await this.#listItem();
-    return toggle.hasClass('completed');
-  }
+  async isCompleted(): Promise<boolean> {}
 
   async isEditModeEnabled(): Promise<boolean> {
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] StringLiteral
app/components/item/item.component.harness.ts:46:28
 
   async isCompleted(): Promise<boolean> {
     const toggle = await this.#listItem();
-    return toggle.hasClass('completed');
+    return toggle.hasClass("");
   }
 
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
app/components/item/item.component.harness.ts:49:47
     return toggle.hasClass('completed');
   }
 
-  async isEditModeEnabled(): Promise<boolean> {
-    const toggle = await this.#editInput();
-    return toggle ? toggle.hasClass('edit') : false;
-  }
+  async isEditModeEnabled(): Promise<boolean> {}
 
   async remove(): Promise<void> {
killedBy: ItemComponent should enable edit mode
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
app/components/item/item.component.harness.ts:51:47
 
   async isEditModeEnabled(): Promise<boolean> {
     const toggle = await this.#editInput();
-    return toggle ? toggle.hasClass('edit') : false;
+    return toggle ? toggle.hasClass('edit') : true;
   }
 
killedBy: ItemComponent should have edit mode off
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] StringLiteral
app/components/item/item.component.harness.ts:51:37
 
   async isEditModeEnabled(): Promise<boolean> {
     const toggle = await this.#editInput();
-    return toggle ? toggle.hasClass('edit') : false;
+    return toggle ? toggle.hasClass("") : false;
   }
 
killedBy: ItemComponent should enable edit mode
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
app/components/item/item.component.harness.ts:54:33
     return toggle ? toggle.hasClass('edit') : false;
   }
 
-  async remove(): Promise<void> {
-    const remove = await this.#remove();
-    await remove.click();
-  }
+  async remove(): Promise<void> {}
 
   async enabledEditMode(): Promise<void> {
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
app/components/item/item.component.harness.ts:59:42
     await remove.click();
   }
 
-  async enabledEditMode(): Promise<void> {
-    const label = await this.#todoLabel();
-    await label.dispatchEvent('dblclick');
-  }
+  async enabledEditMode(): Promise<void> {}
 
   async disableEditMode(): Promise<void> {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
    "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:64:42
     await label.dispatchEvent('dblclick');
   }
 
-  async disableEditMode(): Promise<void> {
-    const editInput = await this.#editInput();
-    if (editInput) {
-      await editInput.blur();
-    }
-  }
+  async disableEditMode(): Promise<void> {}
 
   async edit(todoToUpdate: UpdateTodo): Promise<void> {
killedBy: ListComponent should edit a todo and not mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": false,
    "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:66:20
 
   async disableEditMode(): Promise<void> {
     const editInput = await this.#editInput();
-    if (editInput) {
-      await editInput.blur();
-    }
+    if (editInput) {}
   }
 
killedBy: ListComponent should edit a todo and not mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": false,
    "id": "1",

[Killed] ConditionalExpression
app/components/item/item.component.harness.ts:66:9
 
   async disableEditMode(): Promise<void> {
     const editInput = await this.#editInput();
-    if (editInput) {
+    if (false) {
       await editInput.blur();
     }
killedBy: ListComponent should edit a todo and not mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": false,
    "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:71:55
     }
   }
 
-  async edit(todoToUpdate: UpdateTodo): Promise<void> {
-    const { name, completed } = todoToUpdate;
-    await this.enabledEditMode();
-    const [editInput, isComplete] = await parallel(() => [
-      this.#editInput(),
-      this.isCompleted()
-    ]);
-    if (name && editInput) {
-      await editInput.clear();
-      await editInput.sendKeys(name);
-      await this.disableEditMode();
-    }
-    if (completed && completed !== isComplete) {
-      await this.toggle();
-    }
-  }
+  async edit(todoToUpdate: UpdateTodo): Promise<void> {}
 
   async getTodoData(): Promise<TodoInterface | undefined> {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] ArrowFunction
app/components/item/item.component.harness.ts:74:52
   async edit(todoToUpdate: UpdateTodo): Promise<void> {
     const { name, completed } = todoToUpdate;
     await this.enabledEditMode();
-    const [editInput, isComplete] = await parallel(() => [
-      this.#editInput(),
-      this.isCompleted()
-    ]);
+    const [editInput, isComplete] = await parallel(() => undefined);
     if (name && editInput) {
       await editInput.clear();
killedBy: AppComponent should update a todo by Id
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/components/item/item.component.harness.ts:78:28
       this.#editInput(),
       this.isCompleted()
     ]);
-    if (name && editInput) {
-      await editInput.clear();
-      await editInput.sendKeys(name);
-      await this.disableEditMode();
-    }
+    if (name && editInput) {}
     if (completed && completed !== isComplete) {
       await this.toggle();
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
    "id": "1",

[Killed] ConditionalExpression
app/components/item/item.component.harness.ts:78:9
       this.#editInput(),
       this.isCompleted()
     ]);
-    if (name && editInput) {
+    if (false) {
       await editInput.clear();
       await editInput.sendKeys(name);
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
    "id": "1",

[Killed] BlockStatement
app/components/item/item.component.harness.ts:83:48
       await editInput.sendKeys(name);
       await this.disableEditMode();
     }
-    if (completed && completed !== isComplete) {
-      await this.toggle();
-    }
+    if (completed && completed !== isComplete) {}
   }
 
killedBy: ListComponent should return a list of incomplete todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] EqualityOperator
app/components/item/item.component.harness.ts:83:22
       await editInput.sendKeys(name);
       await this.disableEditMode();
     }
-    if (completed && completed !== isComplete) {
+    if (completed && completed === isComplete) {
       await this.toggle();
     }
killedBy: ListComponent should return a list of incomplete todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] BlockStatement
app/components/item/item.component.harness.ts:88:59
     }
   }
 
-  async getTodoData(): Promise<TodoInterface | undefined> {
-    const [id, name, completed] = await parallel(() => [this.getId(), this.getTodoLabel(), this.isCompleted()]);
-    return { id, name, completed };
-  }
+  async getTodoData(): Promise<TodoInterface | undefined> {}
 }
 
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ArrowFunction
app/components/item/item.component.harness.ts:89:50
   }
 
   async getTodoData(): Promise<TodoInterface | undefined> {
-    const [id, name, completed] = await parallel(() => [this.getId(), this.getTodoLabel(), this.isCompleted()]);
+    const [id, name, completed] = await parallel(() => undefined);
     return { id, name, completed };
   }
killedBy: ListComponent should return a list of completed todos
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ObjectLiteral
app/components/item/item.component.harness.ts:90:12
 
   async getTodoData(): Promise<TodoInterface | undefined> {
     const [id, name, completed] = await parallel(() => [this.getId(), this.getTodoLabel(), this.isCompleted()]);
-    return { id, name, completed };
+    return {};
   }
 }
killedBy: ItemComponent should get todo data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "completed": false,
-   "id": "e2bb892a-844a-47fb-a2b3-47f491af9d88",
