[Killed] BlockStatement
app/components/list/list.component.harness.ts:12:44
   #todos = this.locatorForAll(ItemHarness);
   #allCompleted = this.locatorFor('label');
 
-  async getTodos(): Promise<ItemHarness[]> {
-    const todos = await this.#todos();
-    return todos;
-  }
+  async getTodos(): Promise<ItemHarness[]> {}
 
   async getCompletedTodos(): Promise<ItemHarness[]> {
killedBy: AppComponent should update a todo by Id
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
app/components/list/list.component.harness.ts:17:53
     return todos;
   }
 
-  async getCompletedTodos(): Promise<ItemHarness[]> {
-    const todoList = await this.getTodos();
-    const todos = await this.getTodoData();
-    return todoList.filter((_todo, index) => todos[index]?.completed ?? false);
-  }
+  async getCompletedTodos(): Promise<ItemHarness[]> {}
 
   async getIncompleteTodos(): Promise<ItemHarness[]> {
killedBy: ListComponent should return a list of completed todos
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
app/components/list/list.component.harness.ts:20:28
   async getCompletedTodos(): Promise<ItemHarness[]> {
     const todoList = await this.getTodos();
     const todos = await this.getTodoData();
-    return todoList.filter((_todo, index) => todos[index]?.completed ?? false);
+    return todoList.filter(() => undefined);
   }
 
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] MethodExpression
app/components/list/list.component.harness.ts:20:12
   async getCompletedTodos(): Promise<ItemHarness[]> {
     const todoList = await this.getTodos();
     const todos = await this.getTodoData();
-    return todoList.filter((_todo, index) => todos[index]?.completed ?? false);
+    return todoList;
   }
 
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] BlockStatement
app/components/list/list.component.harness.ts:23:54
     return todoList.filter((_todo, index) => todos[index]?.completed ?? false);
   }
 
-  async getIncompleteTodos(): Promise<ItemHarness[]> {
-    const todoList = await this.getTodos();
-    const todos = await this.getTodoData();
-    return todoList.filter((_todo, index) => !todos[index]?.completed);
-  }
+  async getIncompleteTodos(): Promise<ItemHarness[]> {}
 
   async getTodoById(id: string): Promise<ItemHarness | undefined> {
killedBy: ListComponent should return a list of incomplete todos
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
app/components/list/list.component.harness.ts:26:12
   async getIncompleteTodos(): Promise<ItemHarness[]> {
     const todoList = await this.getTodos();
     const todos = await this.getTodoData();
-    return todoList.filter((_todo, index) => !todos[index]?.completed);
+    return todoList;
   }
 
killedBy: ListComponent should return a list of incomplete todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] BooleanLiteral
app/components/list/list.component.harness.ts:26:46
   async getIncompleteTodos(): Promise<ItemHarness[]> {
     const todoList = await this.getTodos();
     const todos = await this.getTodoData();
-    return todoList.filter((_todo, index) => !todos[index]?.completed);
+    return todoList.filter((_todo, index) => todos[index]?.completed);
   }
 
killedBy: ListComponent should return all todos that are incomplete
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1

[Killed] BlockStatement
app/components/list/list.component.harness.ts:29:67
     return todoList.filter((_todo, index) => !todos[index]?.completed);
   }
 
-  async getTodoById(id: string): Promise<ItemHarness | undefined> {
-    let indexOfTodo = -1;
-    const todoList = await this.getTodos();
-    const todosData = await this.getTodoData();
-    if (!todosData) return;
-    todosData.find((_todoData, index) => {
-      if (_todoData?.id === id) indexOfTodo = index;
-    });
-    return todoList[indexOfTodo];
-  }
+  async getTodoById(id: string): Promise<ItemHarness | undefined> {}
 
   async getTodoDataById(todoId: string): Promise<TodoInterface | undefined> {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Survived] UnaryOperator
app/components/list/list.component.harness.ts:30:23
   }
 
   async getTodoById(id: string): Promise<ItemHarness | undefined> {
-    let indexOfTodo = -1;
+    let indexOfTodo = +1;
     const todoList = await this.getTodos();
     const todosData = await this.getTodoData();

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:33:9
     let indexOfTodo = -1;
     const todoList = await this.getTodos();
     const todosData = await this.getTodoData();
-    if (!todosData) return;
+    if (true) return;
     todosData.find((_todoData, index) => {
       if (_todoData?.id === id) indexOfTodo = index;
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BooleanLiteral
app/components/list/list.component.harness.ts:33:9
     let indexOfTodo = -1;
     const todoList = await this.getTodos();
     const todosData = await this.getTodoData();
-    if (!todosData) return;
+    if (todosData) return;
     todosData.find((_todoData, index) => {
       if (_todoData?.id === id) indexOfTodo = index;
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/list/list.component.harness.ts:34:42
     const todoList = await this.getTodos();
     const todosData = await this.getTodoData();
     if (!todosData) return;
-    todosData.find((_todoData, index) => {
-      if (_todoData?.id === id) indexOfTodo = index;
-    });
+    todosData.find((_todoData, index) => {});
     return todoList[indexOfTodo];
   }
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] EqualityOperator
app/components/list/list.component.harness.ts:35:11
     const todosData = await this.getTodoData();
     if (!todosData) return;
     todosData.find((_todoData, index) => {
-      if (_todoData?.id === id) indexOfTodo = index;
+      if (_todoData?.id !== id) indexOfTodo = index;
     });
     return todoList[indexOfTodo];
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:35:11
     const todosData = await this.getTodoData();
     if (!todosData) return;
     todosData.find((_todoData, index) => {
-      if (_todoData?.id === id) indexOfTodo = index;
+      if (false) indexOfTodo = index;
     });
     return todoList[indexOfTodo];
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/list/list.component.harness.ts:40:77
     return todoList[indexOfTodo];
   }
 
-  async getTodoDataById(todoId: string): Promise<TodoInterface | undefined> {
-    const todos = await this.getTodoData();
-    return todos.find(todo => todo?.id === todoId);
-  }
+  async getTodoDataById(todoId: string): Promise<TodoInterface | undefined> {}
 
   async getTodoData() {
killedBy: ListComponent should update a todo
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] EqualityOperator
app/components/list/list.component.harness.ts:42:31
 
   async getTodoDataById(todoId: string): Promise<TodoInterface | undefined> {
     const todos = await this.getTodoData();
-    return todos.find(todo => todo?.id === todoId);
+    return todos.find(todo => todo?.id !== todoId);
   }
 
killedBy: ListComponent should update a todo
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] ArrowFunction
app/components/list/list.component.harness.ts:42:23
 
   async getTodoDataById(todoId: string): Promise<TodoInterface | undefined> {
     const todos = await this.getTodoData();
-    return todos.find(todo => todo?.id === todoId);
+    return todos.find(() => undefined);
   }
 
killedBy: ListComponent should update a todo
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Timeout] BlockStatement
app/components/list/list.component.harness.ts:45:23
     return todos.find(todo => todo?.id === todoId);
   }
 
-  async getTodoData() {
-    const todoList = await this.getTodos();
-    const todos = await parallel(() => todoList.map(todo => todo.getTodoData()));
-    return todos.filter((todo) => todo !== undefined);
-  }
+  async getTodoData() {}
 
   async removeTodoById(id: string) {

[Timeout] ArrowFunction
app/components/list/list.component.harness.ts:47:34
 
   async getTodoData() {
     const todoList = await this.getTodos();
-    const todos = await parallel(() => todoList.map(todo => todo.getTodoData()));
+    const todos = await parallel(() => undefined);
     return todos.filter((todo) => todo !== undefined);
   }

[Timeout] ArrowFunction
app/components/list/list.component.harness.ts:47:53
 
   async getTodoData() {
     const todoList = await this.getTodos();
-    const todos = await parallel(() => todoList.map(todo => todo.getTodoData()));
+    const todos = await parallel(() => todoList.map(() => undefined));
     return todos.filter((todo) => todo !== undefined);
   }

[Timeout] ArrowFunction
app/components/list/list.component.harness.ts:48:25
   async getTodoData() {
     const todoList = await this.getTodos();
     const todos = await parallel(() => todoList.map(todo => todo.getTodoData()));
-    return todos.filter((todo) => todo !== undefined);
+    return todos.filter(() => undefined);
   }
 

[Timeout] EqualityOperator
app/components/list/list.component.harness.ts:48:35
   async getTodoData() {
     const todoList = await this.getTodos();
     const todos = await parallel(() => todoList.map(todo => todo.getTodoData()));
-    return todos.filter((todo) => todo !== undefined);
+    return todos.filter((todo) => todo === undefined);
   }
 

[Timeout] BlockStatement
app/components/list/list.component.harness.ts:51:36
     return todos.filter((todo) => todo !== undefined);
   }
 
-  async removeTodoById(id: string) {
-    const todo = await this.getTodoById(id);
-    if (todo) await todo.remove();
-  }
+  async removeTodoById(id: string) {}
 
   async removeAllTodos() {

[Timeout] ConditionalExpression
app/components/list/list.component.harness.ts:53:9
 
   async removeTodoById(id: string) {
     const todo = await this.getTodoById(id);
-    if (todo) await todo.remove();
+    if (false) await todo.remove();
   }
 

[Timeout] ConditionalExpression
app/components/list/list.component.harness.ts:53:9
 
   async removeTodoById(id: string) {
     const todo = await this.getTodoById(id);
-    if (todo) await todo.remove();
+    if (true) await todo.remove();
   }
 

[Killed] BlockStatement
app/components/list/list.component.harness.ts:56:26
     if (todo) await todo.remove();
   }
 
-  async removeAllTodos() {
-    const todoList = await this.getTodos();
-    await parallel(() => todoList.map(todo => todo.remove()));
-  }
+  async removeAllTodos() {}
 
   async updateTodo(id: string, todo: UpdateTodo) {
killedBy: AppComponent should delete all todos
statusReason: Error: expect(received).toBeNull()

[Killed] ArrowFunction
app/components/list/list.component.harness.ts:58:20
 
   async removeAllTodos() {
     const todoList = await this.getTodos();
-    await parallel(() => todoList.map(todo => todo.remove()));
+    await parallel(() => undefined);
   }
 
killedBy: AppComponent should delete all todos
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
app/components/list/list.component.harness.ts:58:39
 
   async removeAllTodos() {
     const todoList = await this.getTodos();
-    await parallel(() => todoList.map(todo => todo.remove()));
+    await parallel(() => todoList.map(() => undefined));
   }
 
killedBy: AppComponent should delete all todos
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
app/components/list/list.component.harness.ts:61:50
     await parallel(() => todoList.map(todo => todo.remove()));
   }
 
-  async updateTodo(id: string, todo: UpdateTodo) {
-    const todoItem = await this.getTodoById(id);
-    if (todoItem) await todoItem.edit(todo);
-  }
+  async updateTodo(id: string, todo: UpdateTodo) {}
 
   async markAllTodosAsComplete() {
killedBy: ListComponent should update a todo
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:63:9
 
   async updateTodo(id: string, todo: UpdateTodo) {
     const todoItem = await this.getTodoById(id);
-    if (todoItem) await todoItem.edit(todo);
+    if (false) await todoItem.edit(todo);
   }
 
killedBy: ListComponent should update a todo
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Survived] ConditionalExpression
app/components/list/list.component.harness.ts:63:9
 
   async updateTodo(id: string, todo: UpdateTodo) {
     const todoItem = await this.getTodoById(id);
-    if (todoItem) await todoItem.edit(todo);
+    if (true) await todoItem.edit(todo);
   }
 

[Killed] BlockStatement
app/components/list/list.component.harness.ts:66:34
     if (todoItem) await todoItem.edit(todo);
   }
 
-  async markAllTodosAsComplete() {
-    const markAsComplete = await this.#allCompleted();
-    await markAsComplete.click();
-  }
+  async markAllTodosAsComplete() {}
 
   async areAllTodosComplete(): Promise<boolean> {
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Killed] BlockStatement
app/components/list/list.component.harness.ts:71:49
     await markAsComplete.click();
   }
 
-  async areAllTodosComplete(): Promise<boolean> {
-    const todoList = (await this.getTodoData()).map(
-      todo => todo != undefined && todo.completed !== undefined && todo.completed
-    );
-    return todoList.every(todo => todo);
-  }
+  async areAllTodosComplete(): Promise<boolean> {}
 }
 
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
app/components/list/list.component.harness.ts:73:15
 
   async areAllTodosComplete(): Promise<boolean> {
     const todoList = (await this.getTodoData()).map(
-      todo => todo != undefined && todo.completed !== undefined && todo.completed
+      todo => false
     );
     return todoList.every(todo => todo);
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
app/components/list/list.component.harness.ts:73:36
 
   async areAllTodosComplete(): Promise<boolean> {
     const todoList = (await this.getTodoData()).map(
-      todo => todo != undefined && todo.completed !== undefined && todo.completed
+      todo => todo != undefined && todo.completed === undefined && todo.completed
     );
     return todoList.every(todo => todo);
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
app/components/list/list.component.harness.ts:75:12
     const todoList = (await this.getTodoData()).map(
       todo => todo != undefined && todo.completed !== undefined && todo.completed
     );
-    return todoList.every(todo => todo);
+    return todoList.some(todo => todo);
   }
 }
killedBy: ListComponent should return false if all todos are not completed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
app/components/list/list.component.harness.ts:75:27
     const todoList = (await this.getTodoData()).map(
       todo => todo != undefined && todo.completed !== undefined && todo.completed
     );
-    return todoList.every(todo => todo);
+    return todoList.every(() => undefined);
   }
 }
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
