[Killed] ConditionalExpression
app/store/todo/todo.reducer.ts:8:19
 import { selectCompleted, selectNotCompleted } from './todo.selector';
 
 const areAllCompleted = (state: ReadonlyArray<TodoInterface>) =>
-  state.length && selectCompleted(state).length === state.length;
+  state.length && true;
 
 export const createTodoReducer = (initialState: ReadonlyArray<TodoInterface>) =>
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Killed] LogicalOperator
app/store/todo/todo.reducer.ts:8:3
 import { selectCompleted, selectNotCompleted } from './todo.selector';
 
 const areAllCompleted = (state: ReadonlyArray<TodoInterface>) =>
-  state.length && selectCompleted(state).length === state.length;
+  state.length || selectCompleted(state).length === state.length;
 
 export const createTodoReducer = (initialState: ReadonlyArray<TodoInterface>) =>
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Killed] BlockStatement
app/store/todo/todo.reducer.ts:13:68
 export const createTodoReducer = (initialState: ReadonlyArray<TodoInterface>) =>
   createReducer(
     initialState,
-    on(onLoad, (state: ReadonlyArray<TodoInterface>, { todos }) => {
-      return todos;
-    }),
+    on(onLoad, (state: ReadonlyArray<TodoInterface>, { todos }) => {}),
     on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
       return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
killedBy: AppComponent should initialize todos
statusReason: SyntaxError: "undefined" is not valid JSON

[Killed] BlockStatement
app/store/todo/todo.reducer.ts:16:69
     on(onLoad, (state: ReadonlyArray<TodoInterface>, { todos }) => {
       return todos;
     }),
-    on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
-      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
-    }),
+    on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {}),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
       return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
killedBy: AppComponent should return a FooterHarness
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
app/store/todo/todo.reducer.ts:17:107
       return todos;
     }),
     on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
-      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
+      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? true }];
     }),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] LogicalOperator
app/store/todo/todo.reducer.ts:17:89
       return todos;
     }),
     on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
-      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
+      return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed && false }];
     }),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
killedBy: todosReducer should create new todo
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: undefined

[Killed] BlockStatement
app/store/todo/todo.reducer.ts:19:71
     on(onCreate, (state: ReadonlyArray<TodoInterface>, { todo }) => {
       return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
     }),
-    on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
-      return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
-    }),
+    on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {}),
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
       return state.filter(todo => todo.id !== id);
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"completed": true, "id": "1", "name": "Test002"}
Received: undefined

[Killed] ConditionalExpression
app/store/todo/todo.reducer.ts:20:33
       return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
     }),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
-      return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
+      return state.map(todo => (false ? { ...todo, ...values } : todo));
     }),
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
killedBy: ListComponent should return a list of completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
app/store/todo/todo.reducer.ts:20:33
       return [...state, { id: todo.id ? todo.id : uuidv4(), name: todo.name, completed: todo.completed ?? false }];
     }),
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
-      return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
+      return state.map(todo => (true ? { ...todo, ...values } : todo));
     }),
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -1,10 +1,10 @@
  Array [
    Object {

[Killed] BlockStatement
app/store/todo/todo.reducer.ts:22:67
     on(onUpdate, (state: ReadonlyArray<TodoInterface>, { values }) => {
       return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
     }),
-    on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
-      return state.filter(todo => todo.id !== id);
-    }),
+    on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {}),
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
       return state.map(todo => ({ ...todo, ...{ completed: !areAllCompleted(state) } }));
killedBy: AppComponent should return a ListHarness
statusReason: SyntaxError: "undefined" is not valid JSON

[Killed] ArrowFunction
app/store/todo/todo.reducer.ts:23:27
       return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
     }),
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
-      return state.filter(todo => todo.id !== id);
+      return state.filter(() => undefined);
     }),
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
killedBy: ListComponent should remove 1 todo
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] MethodExpression
app/store/todo/todo.reducer.ts:23:14
       return state.map(todo => (todo.id === values.id ? { ...todo, ...values } : todo));
     }),
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
-      return state.filter(todo => todo.id !== id);
+      return state;
     }),
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 6

[Killed] BlockStatement
app/store/todo/todo.reducer.ts:25:64
     on(onRemove, (state: ReadonlyArray<TodoInterface>, { id }) => {
       return state.filter(todo => todo.id !== id);
     }),
-    on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
-      return state.map(todo => ({ ...todo, ...{ completed: !areAllCompleted(state) } }));
-    }),
+    on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {}),
     on(onClearCompleted, (state: ReadonlyArray<TodoInterface>) => {
       return selectNotCompleted(state);
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
app/store/todo/todo.reducer.ts:26:24
       return state.filter(todo => todo.id !== id);
     }),
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
-      return state.map(todo => ({ ...todo, ...{ completed: !areAllCompleted(state) } }));
+      return state.map(() => undefined);
     }),
     on(onClearCompleted, (state: ReadonlyArray<TodoInterface>) => {
killedBy: ListComponent should mark all todos as complete
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
app/store/todo/todo.reducer.ts:26:60
       return state.filter(todo => todo.id !== id);
     }),
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
-      return state.map(todo => ({ ...todo, ...{ completed: !areAllCompleted(state) } }));
+      return state.map(todo => ({ ...todo, ...{ completed: areAllCompleted(state) } }));
     }),
     on(onClearCompleted, (state: ReadonlyArray<TodoInterface>) => {
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[NoCoverage] BlockStatement
app/store/todo/todo.reducer.ts:28:67
     on(onCompleteAll, (state: ReadonlyArray<TodoInterface>) => {
       return state.map(todo => ({ ...todo, ...{ completed: !areAllCompleted(state) } }));
     }),
-    on(onClearCompleted, (state: ReadonlyArray<TodoInterface>) => {
-      return selectNotCompleted(state);
-    })
+    on(onClearCompleted, (state: ReadonlyArray<TodoInterface>) => {})
   );
 
