[Timeout] BlockStatement
app/store/todo/todo.selector.ts:6:70
 import { TodoStateInterface } from '../todo-state.interface';
 import { createSelector } from '@ngrx/store';
 
-export function selectVisible({ todos, filter }: TodoStateInterface) {
-  switch (filter) {
-    case FILTERS.all:
-      return [...todos];
-    case FILTERS.completed:
-      return selectCompleted(todos);
-    case FILTERS.active:
-      return selectNotCompleted(todos);
-    default:
-      return [...todos];
-  }
-}
+export function selectVisible({ todos, filter }: TodoStateInterface) {}
 
 export const selectAllCompleted = createSelector(

[Timeout] ConditionalExpression
app/store/todo/todo.selector.ts:8:5
 
 export function selectVisible({ todos, filter }: TodoStateInterface) {
   switch (filter) {
-    case FILTERS.all:
-      return [...todos];
+    case FILTERS.all:
     case FILTERS.completed:
       return selectCompleted(todos);

[Timeout] ArrayDeclaration
app/store/todo/todo.selector.ts:9:14
 export function selectVisible({ todos, filter }: TodoStateInterface) {
   switch (filter) {
     case FILTERS.all:
-      return [...todos];
+      return [];
     case FILTERS.completed:
       return selectCompleted(todos);

[Killed] ConditionalExpression
app/store/todo/todo.selector.ts:10:5
   switch (filter) {
     case FILTERS.all:
       return [...todos];
-    case FILTERS.completed:
-      return selectCompleted(todos);
+    case FILTERS.completed:
     case FILTERS.active:
       return selectNotCompleted(todos);
killedBy: AppComponent should show completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Killed] ConditionalExpression
app/store/todo/todo.selector.ts:12:5
       return [...todos];
     case FILTERS.completed:
       return selectCompleted(todos);
-    case FILTERS.active:
-      return selectNotCompleted(todos);
+    case FILTERS.active:
     default:
       return [...todos];
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,

[NoCoverage] ConditionalExpression
app/store/todo/todo.selector.ts:14:5
       return selectCompleted(todos);
     case FILTERS.active:
       return selectNotCompleted(todos);
-    default:
-      return [...todos];
+    default:
   }
 }

[NoCoverage] ArrayDeclaration
app/store/todo/todo.selector.ts:15:14
     case FILTERS.active:
       return selectNotCompleted(todos);
     default:
-      return [...todos];
+      return [];
   }
 }

[Timeout] ConditionalExpression
app/store/todo/todo.selector.ts:21:44
 
 export const selectAllCompleted = createSelector(
   (state: TodoStateInterface) => state.todos,
-  (todos: ReadonlyArray<TodoInterface>) => todos.length && todos.every(todo => todo.completed)
+  (todos: ReadonlyArray<TodoInterface>) => true
 );
 

[Timeout] ConditionalExpression
app/store/todo/todo.selector.ts:21:44
 
 export const selectAllCompleted = createSelector(
   (state: TodoStateInterface) => state.todos,
-  (todos: ReadonlyArray<TodoInterface>) => todos.length && todos.every(todo => todo.completed)
+  (todos: ReadonlyArray<TodoInterface>) => false
 );
 

[Timeout] BlockStatement
app/store/todo/todo.selector.ts:34:103
   (todos: ReadonlyArray<TodoInterface>) => selectCompleted(todos).length
 );
 
-export function selectNotCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => !todo.completed);
-}
+export function selectNotCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {}
 
 export function selectCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {

[Killed] BooleanLiteral
app/store/todo/todo.selector.ts:35:31
 );
 
 export function selectNotCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => !todo.completed);
+  return todos.filter(todo => todo.completed);
 }
 
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": false,

[Timeout] MethodExpression
app/store/todo/todo.selector.ts:35:10
 );
 
 export function selectNotCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => !todo.completed);
+  return todos;
 }
 

[Killed] BlockStatement
app/store/todo/todo.selector.ts:38:100
   return todos.filter(todo => !todo.completed);
 }
 
-export function selectCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => todo.completed);
-}
+export function selectCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {}
 
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
app/store/todo/todo.selector.ts:39:23
 }
 
 export function selectCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => todo.completed);
+  return todos.filter(() => undefined);
 }
 
killedBy: AppComponent should show completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "completed": true,

[Killed] MethodExpression
app/store/todo/todo.selector.ts:39:10
 }
 
 export function selectCompleted(todos: ReadonlyArray<TodoInterface>): ReadonlyArray<TodoInterface> {
-  return todos.filter(todo => todo.completed);
+  return todos;
 }
 
killedBy: ListComponent should mark all todos as complete
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
