[NoCoverage] BlockStatement
src/jest-global-mocks.ts:6:16
 });
 
 Object.defineProperty(window, 'getComputedStyle', {
-  value: () => {
-    return {
-      display: 'none',
-      appearance: ['-webkit-appearance'],
-    };
-  },
+  value: () => {},
 });
 

[NoCoverage] BlockStatement
src/jest-global-mocks.ts:19:16
  * Workaround for JSDOM missing transform property
  */
 Object.defineProperty(document.body.style, 'transform', {
-  value: () => {
-    return {
-      enumerable: true,
-      configurable: true,
-    };
-  },
+  value: () => {},
 });

[NoCoverage] BooleanLiteral
src/jest-global-mocks.ts:21:19
 Object.defineProperty(document.body.style, 'transform', {
   value: () => {
     return {
-      enumerable: true,
+      enumerable: false,
       configurable: true,
     };

[NoCoverage] BooleanLiteral
src/jest-global-mocks.ts:22:21
   value: () => {
     return {
       enumerable: true,
-      configurable: true,
+      configurable: false,
     };
   },
