[NoCoverage] ArrowFunction
src/main.ts:5:53
 import { appConfig } from './app/app.config';
 import { AppComponent } from './app/components/app/app.component';
 
-bootstrapApplication(AppComponent, appConfig).catch(err => console.error(err));
+bootstrapApplication(AppComponent, appConfig).catch(() => undefined);
 
