[Killed] BlockStatement
app/components/copy-right/copy-right.component.harness.ts:6:36
 export class CopyRightHarness extends ComponentHarness {
   static readonly hostSelector = 'app-copy-right';
 
-  async getInfo(): Promise<string> {
-    return (await this.host()).text();
-  }
+  async getInfo(): Promise<string> {}
 }
 
killedBy: CopyRightComponent should render component
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined
