[Killed] BlockStatement
app/components/header/header.component.harness.ts:8:46
 
   #addTodo = this.locatorFor('input');
 
-  async addTodo(name: string): Promise<void> {
-    const input = await this.#addTodo();
-    await input.clear();
-    await input.sendKeys(name, TestKey.ENTER);
-  }
+  async addTodo(name: string): Promise<void> {}
 }
 
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   Object {
-     "completed": false,
