[Survived] StringLiteral
app/components/header/header.component.ts:26:10
   standalone: true
 })
 export class HeaderComponent {
-  name = '';
+  name = "Stryker was here!";
 
   constructor(private store: Store<TodoStateInterface>) {}

[Killed] BlockStatement
app/components/header/header.component.ts:30:30
 
   constructor(private store: Store<TodoStateInterface>) {}
 
-  handleChange(event: Event) {
-    this.name = (event.target as HTMLInputElement).value;
-  }
+  handleChange(event: Event) {}
 
   handleSubmit(event: KeyboardEvent) {
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
      "completed": false,

[Killed] BlockStatement
app/components/header/header.component.ts:34:38
     this.name = (event.target as HTMLInputElement).value;
   }
 
-  handleSubmit(event: KeyboardEvent) {
-    if (event.key !== ENTER_KEY) {
-      return;
-    }
-
-    this.store.dispatch(onCreate({ id: uuidv4(), name: this.name }));
-    this.name = '';
-  }
+  handleSubmit(event: KeyboardEvent) {}
 }
 
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   Object {
-     "completed": false,

[Killed] ConditionalExpression
app/components/header/header.component.ts:35:9
   }
 
   handleSubmit(event: KeyboardEvent) {
-    if (event.key !== ENTER_KEY) {
+    if (true) {
       return;
     }
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   Object {
-     "completed": false,

[Killed] BlockStatement
app/components/header/header.component.ts:35:34
   }
 
   handleSubmit(event: KeyboardEvent) {
-    if (event.key !== ENTER_KEY) {
-      return;
-    }
+    if (event.key !== ENTER_KEY) {}
 
     this.store.dispatch(onCreate({ id: uuidv4(), name: this.name }));
killedBy: AppComponent should display all todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 71

  Array [
    Object {
      "completed": false,
