[Killed] BooleanLiteral
app/components/item/item.component.ts:24:13
   imports: [NgClass, FormsModule]
 })
 export class ItemComponent implements OnChanges {
-  editing = false;
+  editing = true;
 
   name = '';
killedBy: ItemComponent should have edit mode off
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: false
Received: true

[Killed] BlockStatement
app/components/item/item.component.ts:37:39
   @Output()
   update = new EventEmitter<TodoInterface>();
 
-  ngOnChanges(changes: SimpleChanges) {
-    if (changes.todo) {
-      this.name = changes.todo.currentValue.name;
-    }
-  }
+  ngOnChanges(changes: SimpleChanges) {}
 
   handleRemove() {
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,8 +5,8 @@
      "name": "Test001",
    },

[Killed] BlockStatement
app/components/item/item.component.ts:38:23
   update = new EventEmitter<TodoInterface>();
 
   ngOnChanges(changes: SimpleChanges) {
-    if (changes.todo) {
-      this.name = changes.todo.currentValue.name;
-    }
+    if (changes.todo) {}
   }
 
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,8 +5,8 @@
      "name": "Test001",
    },

[Killed] ConditionalExpression
app/components/item/item.component.ts:38:9
   update = new EventEmitter<TodoInterface>();
 
   ngOnChanges(changes: SimpleChanges) {
-    if (changes.todo) {
+    if (false) {
       this.name = changes.todo.currentValue.name;
     }
killedBy: AppComponent should mark single todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,8 +5,8 @@
      "name": "Test001",
    },

[Killed] BlockStatement
app/components/item/item.component.ts:43:18
     }
   }
 
-  handleRemove() {
-    this.remove.emit(this.todo.id);
-  }
+  handleRemove() {}
 
   handleBlur() {
killedBy: ItemComponent should notify about remove button
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "e2bb892a-844a-47fb-a2b3-47f491af9d88"

[Killed] BlockStatement
app/components/item/item.component.ts:47:16
     this.remove.emit(this.todo.id);
   }
 
-  handleBlur() {
-    this.update.emit({ id: this.todo.id, name: this.name, completed: this.todo.completed });
-    this.editing = false;
-  }
+  handleBlur() {}
 
   handleEdit() {
killedBy: ListComponent should edit a todo and not mark it as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": false,
    "id": "1",

[Survived] BooleanLiteral
app/components/item/item.component.ts:49:20
 
   handleBlur() {
     this.update.emit({ id: this.todo.id, name: this.name, completed: this.todo.completed });
-    this.editing = false;
+    this.editing = true;
   }
 

[Killed] BlockStatement
app/components/item/item.component.ts:52:16
     this.editing = false;
   }
 
-  handleEdit() {
-    this.editing = true;
-  }
+  handleEdit() {}
 
   handleCompleted() {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
    "id": "1",

[Killed] BooleanLiteral
app/components/item/item.component.ts:53:20
   }
 
   handleEdit() {
-    this.editing = true;
+    this.editing = false;
   }
 
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": true,
    "id": "1",

[Killed] BlockStatement
app/components/item/item.component.ts:56:21
     this.editing = true;
   }
 
-  handleCompleted() {
-    this.update.emit({ id: this.todo.id, name: this.name, completed: !this.todo.completed });
-  }
+  handleCompleted() {}
 }
 
killedBy: ItemComponent should check todo item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BooleanLiteral
app/components/item/item.component.ts:57:70
   }
 
   handleCompleted() {
-    this.update.emit({ id: this.todo.id, name: this.name, completed: !this.todo.completed });
+    this.update.emit({ id: this.todo.id, name: this.name, completed: this.todo.completed });
   }
 }
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "completed": true,
+   "completed": false,

[Killed] ObjectLiteral
app/components/item/item.component.ts:57:22
   }
 
   handleCompleted() {
-    this.update.emit({ id: this.todo.id, name: this.name, completed: !this.todo.completed });
+    this.update.emit({});
   }
 }
killedBy: ItemComponent should check todo item
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
