[Killed] BlockStatement
src/app/services/todo-local.service.ts:6:39
 const LOCAL_STORAGE_KEY = 'todoapp_todos';
 
 export class TodoLocalService {
-  static loadTodos(): TodoInterface[] {
-    return JSON.parse(window.localStorage.getItem(LOCAL_STORAGE_KEY) || '[]');
-  }
+  static loadTodos(): TodoInterface[] {}
 
   static storeTodos(todos: TodoInterface[]) {
killedBy: AppComponent should initialize todos
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/app/services/todo-local.service.ts:7:23
 
 export class TodoLocalService {
   static loadTodos(): TodoInterface[] {
-    return JSON.parse(window.localStorage.getItem(LOCAL_STORAGE_KEY) || '[]');
+    return JSON.parse(false);
   }
 
killedBy: AppComponent should initialize todos
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/app/services/todo-local.service.ts:7:23
 
 export class TodoLocalService {
   static loadTodos(): TodoInterface[] {
-    return JSON.parse(window.localStorage.getItem(LOCAL_STORAGE_KEY) || '[]');
+    return JSON.parse(true);
   }
 
killedBy: AppComponent should initialize todos
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] BlockStatement
src/app/services/todo-local.service.ts:10:45
     return JSON.parse(window.localStorage.getItem(LOCAL_STORAGE_KEY) || '[]');
   }
 
-  static storeTodos(todos: TodoInterface[]) {
-    window.localStorage.setItem(LOCAL_STORAGE_KEY, JSON.stringify(todos));
-  }
+  static storeTodos(todos: TodoInterface[]) {}
 }
 
