[Killed] ObjectLiteral
app/store/filter/filter.action.ts:4:92
 import { createAction } from '@ngrx/store';
 import { ACTION_TYPES } from '../../constants/action-type';
 
-export const onFilterSelect = createAction(ACTION_TYPES.selectFilter, (filter: string) => ({ filter }));
+export const onFilterSelect = createAction(ACTION_TYPES.selectFilter, (filter: string) => ({}));
 
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,
