[Killed] BlockStatement
app/store/filter/filter.reducer.ts:8:48
 export const createFilterReducer = (initialState: string = FILTERS.all) =>
   createReducer(
     initialState,
-    on(onFilterSelect, (_state, { filter }) => {
-      return filter;
-    })
+    on(onFilterSelect, (_state, { filter }) => {})
   );
 
killedBy: AppComponent should display active todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "completed": true,
