[Killed] ObjectLiteral
app/store/todo/todo.action.ts:5:84
 import { ACTION_TYPES } from '../../constants/action-type';
 import { TodoInterface } from '../../services/todo.interface';
 
-export const onLoad = createAction(ACTION_TYPES.load, (todos: TodoInterface[]) => ({ todos }));
+export const onLoad = createAction(ACTION_TYPES.load, (todos: TodoInterface[]) => ({}));
 
 export const onCreate = createAction(ACTION_TYPES.create, (todo: TodoInterface) => ({ todo }));
killedBy: AppComponent should initialize todos
statusReason: SyntaxError: "undefined" is not valid JSON

[Killed] ObjectLiteral
app/store/todo/todo.action.ts:9:76
 
 export const onCreate = createAction(ACTION_TYPES.create, (todo: TodoInterface) => ({ todo }));
 
-export const onRemove = createAction(ACTION_TYPES.remove, (id: string) => ({ id }));
+export const onRemove = createAction(ACTION_TYPES.remove, (id: string) => ({}));
 
 export const onUpdate = createAction(ACTION_TYPES.update, (values: TodoInterface) => ({ values }));
killedBy: TodoService should delete a todo by Id
statusReason: Error: expect(received).toBeUndefined()

Received: {"completed": false, "id": "1", "name": "Demo"}

[Killed] ObjectLiteral
app/store/todo/todo.action.ts:11:87
 
 export const onRemove = createAction(ACTION_TYPES.remove, (id: string) => ({ id }));
 
-export const onUpdate = createAction(ACTION_TYPES.update, (values: TodoInterface) => ({ values }));
+export const onUpdate = createAction(ACTION_TYPES.update, (values: TodoInterface) => ({}));
 
 export const onCompleteAll = createAction(ACTION_TYPES.completeAll);
killedBy: TodoService should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "completed": false,
    "id": "1",
