[Killed] BlockStatement
app/components/app/app.component.ts:33:57
 export class AppComponent implements OnInit {
   todos$: Observable<TodoInterface[]>;
 
-  constructor(private store: Store<TodoStateInterface>) {
-    this.todos$ = this.store.select('todos');
-  }
+  constructor(private store: Store<TodoStateInterface>) {}
 
   ngOnInit() {
killedBy: AppComponent should initialize todos
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Survived] BlockStatement
app/components/app/app.component.ts:37:14
     this.todos$ = this.store.select('todos');
   }
 
-  ngOnInit() {
-    this.store.dispatch(onLoad(TodoLocalService.loadTodos()));
-    this.todos$.subscribe(todos => TodoLocalService.storeTodos(todos));
-  }
+  ngOnInit() {}
 }
 

[Survived] ArrowFunction
app/components/app/app.component.ts:39:27
 
   ngOnInit() {
     this.store.dispatch(onLoad(TodoLocalService.loadTodos()));
-    this.todos$.subscribe(todos => TodoLocalService.storeTodos(todos));
+    this.todos$.subscribe(() => undefined);
   }
 }
