[Killed] BlockStatement
app/components/list/list.component.ts:28:49
 
   allCompleted$: Observable<boolean>;
 
-  constructor(private todoService: TodoService) {
-    this.visibleTodos$ = todoService.getTodos();
-    this.allCompleted$ = todoService.completedTodos();
-  }
+  constructor(private todoService: TodoService) {}
 
   public handleRemove(id: string) {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/list/list.component.ts:33:35
     this.allCompleted$ = todoService.completedTodos();
   }
 
-  public handleRemove(id: string) {
-    this.todoService.deleteTodo(id);
-  }
+  public handleRemove(id: string) {}
 
   public handleUpdate(values: TodoInterface) {
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
app/components/list/list.component.ts:37:46
     this.todoService.deleteTodo(id);
   }
 
-  public handleUpdate(values: TodoInterface) {
-    this.todoService.updateTodo(values);
-  }
+  public handleUpdate(values: TodoInterface) {}
 
   public handleCompleteAll() {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
app/components/list/list.component.ts:41:30
     this.todoService.updateTodo(values);
   }
 
-  public handleCompleteAll() {
-    this.todoService.toggleCompleted();
-  }
+  public handleCompleteAll() {}
 }
 
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,
