[Killed] BlockStatement
src/app/services/todo.service.ts:15:26
 export class TodoService {
   constructor(private store: Store<TodoStateInterface>) {}
 
-  addTodo(todo: AddTodo) {
-    this.store.dispatch(onCreate(todo));
-  }
+  addTodo(todo: AddTodo) {}
 
   getTodos(): Observable<ReadonlyArray<TodoInterface>> {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"completed": true, "id": "1", "name": "Test002"}
Received: undefined

[Killed] BlockStatement
src/app/services/todo.service.ts:19:56
     this.store.dispatch(onCreate(todo));
   }
 
-  getTodos(): Observable<ReadonlyArray<TodoInterface>> {
-    return this.store.select(selectVisible);
-  }
+  getTodos(): Observable<ReadonlyArray<TodoInterface>> {}
 
   getTodoById(id: string): Observable<Readonly<TodoInterface | undefined>> {
killedBy: AppComponent should initialize todos
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/services/todo.service.ts:23:76
     return this.store.select(selectVisible);
   }
 
-  getTodoById(id: string): Observable<Readonly<TodoInterface | undefined>> {
-    return this.getTodos().pipe(map(todos => todos.find(todo => todo.id === id)));
-  }
+  getTodoById(id: string): Observable<Readonly<TodoInterface | undefined>> {}
 
   updateTodo(todo: TodoInterface) {
killedBy: AppComponent should update a todo by Id
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ConditionalExpression
src/app/services/todo.service.ts:24:65
   }
 
   getTodoById(id: string): Observable<Readonly<TodoInterface | undefined>> {
-    return this.getTodos().pipe(map(todos => todos.find(todo => todo.id === id)));
+    return this.getTodos().pipe(map(todos => todos.find(todo => false)));
   }
 
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"completed": true, "id": "1", "name": "Test002"}
Received: undefined

[Killed] ArrowFunction
src/app/services/todo.service.ts:24:37
   }
 
   getTodoById(id: string): Observable<Readonly<TodoInterface | undefined>> {
-    return this.getTodos().pipe(map(todos => todos.find(todo => todo.id === id)));
+    return this.getTodos().pipe(map(() => undefined));
   }
 
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"completed": true, "id": "1", "name": "Test002"}
Received: undefined

[Killed] BlockStatement
src/app/services/todo.service.ts:27:35
     return this.getTodos().pipe(map(todos => todos.find(todo => todo.id === id)));
   }
 
-  updateTodo(todo: TodoInterface) {
-    this.store.dispatch(onUpdate(todo));
-  }
+  updateTodo(todo: TodoInterface) {}
 
   deleteTodo(id: string) {
killedBy: AppComponent should update a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "completed": true,
+   "completed": false,

[Killed] BlockStatement
src/app/services/todo.service.ts:31:26
     this.store.dispatch(onUpdate(todo));
   }
 
-  deleteTodo(id: string) {
-    this.store.dispatch(onRemove(id));
-  }
+  deleteTodo(id: string) {}
 
   getCompletedTodos(): Observable<ReadonlyArray<TodoInterface>> {
killedBy: AppComponent should delete a todo by Id
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 6

[Killed] BlockStatement
src/app/services/todo.service.ts:35:65
     this.store.dispatch(onRemove(id));
   }
 
-  getCompletedTodos(): Observable<ReadonlyArray<TodoInterface>> {
-    return this.getTodos().pipe(map(todos => todos.filter(todo => todo.completed)));
-  }
+  getCompletedTodos(): Observable<ReadonlyArray<TodoInterface>> {}
 
   completedTodos(): Observable<boolean> {
killedBy: TodoService should get completed todos
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
src/app/services/todo.service.ts:36:59
   }
 
   getCompletedTodos(): Observable<ReadonlyArray<TodoInterface>> {
-    return this.getTodos().pipe(map(todos => todos.filter(todo => todo.completed)));
+    return this.getTodos().pipe(map(todos => todos.filter(() => undefined)));
   }
 
killedBy: TodoService should get completed todos
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"completed": true, "id": Any<String>, "name": "Demo"}
Received: undefined

[Killed] ArrowFunction
src/app/services/todo.service.ts:36:37
   }
 
   getCompletedTodos(): Observable<ReadonlyArray<TodoInterface>> {
-    return this.getTodos().pipe(map(todos => todos.filter(todo => todo.completed)));
+    return this.getTodos().pipe(map(() => undefined));
   }
 
killedBy: TodoService should get completed todos
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/app/services/todo.service.ts:39:41
     return this.getTodos().pipe(map(todos => todos.filter(todo => todo.completed)));
   }
 
-  completedTodos(): Observable<boolean> {
-    return this.store.select(selectAllCompleted).pipe(map(completed => !!completed));
-  }
+  completedTodos(): Observable<boolean> {}
 
   toggleCompleted() {
killedBy: TodoService should indicate if all todos are complete
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BooleanLiteral
src/app/services/todo.service.ts:40:72
   }
 
   completedTodos(): Observable<boolean> {
-    return this.store.select(selectAllCompleted).pipe(map(completed => !!completed));
+    return this.store.select(selectAllCompleted).pipe(map(completed => !completed));
   }
 
killedBy: TodoService should indicate if all todos are complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false

[Killed] BlockStatement
src/app/services/todo.service.ts:43:21
     return this.store.select(selectAllCompleted).pipe(map(completed => !!completed));
   }
 
-  toggleCompleted() {
-    this.store.dispatch(onCompleteAll());
-  }
+  toggleCompleted() {}
 
   deleteTodos(ids: string[]) {
killedBy: TodoService should toggle all todos as completed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "completed": true,

[Killed] BlockStatement
src/app/services/todo.service.ts:47:30
     this.store.dispatch(onCompleteAll());
   }
 
-  deleteTodos(ids: string[]) {
-    for (const id of ids) {
-      this.deleteTodo(id);
-    }
-  }
+  deleteTodos(ids: string[]) {}
 }
 
killedBy: AppComponent should return null for a FooterHarness if no todos are defined
statusReason: Error: expect(received).toBeNull()

[Killed] BlockStatement
src/app/services/todo.service.ts:48:27
   }
 
   deleteTodos(ids: string[]) {
-    for (const id of ids) {
-      this.deleteTodo(id);
-    }
+    for (const id of ids) {}
   }
 }
killedBy: AppComponent should mark all todos as complete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 25

@@ -1,8 +1,33 @@
  Array [
    Object {
